{
  "quizSrc": [
    {
      "term": "Question 1In Marketing, Noon Nopi is _________.a. matching of the eye levels between parties.b. what fosters relationshipsc. the essence of Marketingd. internal or externale. all of the above",
      "definition": "e. all of the above"
    },
    {
      "term": "The key difference between Marketing and International Marketing is that in International Marketing you are ___________.A. getting your eyes checkedB. adding a domestic marketC. bringing over aspects from other cultures to your home marketD. adding a new business partnerE. adding a market abroad",
      "definition": "E. adding a market abroad"
    },
    {
      "term": "Etic emphasizes _______ understanding while Emic emphasizes _______ and context specific understanding.A. culture-bound : culture-freeB. corporate : personalC. culture-free : culture-savvyD. culture-free : culture-boundE. culture-savvy : culture-bound",
      "definition": "D. culture-free : culture-bound"
    },
    {
      "term": "Question 4The 4P's of Marketing are _________.A. Place, People, Price, and PromotionB. Place, People, Price, and ProductC. Price, Promotion, People, and PlanD. Product, Price, Plan, and PromotionE. Product, Price, Place, and Promotion",
      "definition": "E. Product, Price, Place, and Promotion"
    },
    {
      "term": "Marketing Execution is __________.A. Noon Nopi realizedB. marketing by combatC. a way for companies to carry out price cutsD. a marketing death sentenceE none of the above",
      "definition": "A. Noon Nopi realized"
    },
    {
      "term": "Which of the following is something we can learn from adaptive organisms?A. Add more function to surviveB. Learn to hide betterC. Do not align evaluation methods with risksD. Make the dinosaurs extinct firstE. Study the adaptive organisms' DNA to find out how to become one",
      "definition": "A. Add more function to survive"
    },
    {
      "term": "A common problem when asking the question \"what business a company is in\", is that __________.A. some companies limit themselves to what they produce and not what they compete againstB. some companies focus on the consumersC. some companies focus only on the profitsD. some companies are undecidedE. some companies really just don't care",
      "definition": "A. some companies limit themselves to what they produce and not what they compete against"
    },
    {
      "term": "In the \"Strategic Intent\" phase of the innovation process, the most important aspect is __________.A. reject bad ideasB. always have a backup plan just in case employees go rogueC. to have an open mindset and allow the pursuit of new technologiesD. to make sure the executives of the company are happyto select a diverse innovation team",
      "definition": "C. to have an open mindset and allow the pursuit of new technologies"
    },
    {
      "term": "In Cross Industry Innovation, you can __________.A. source ideas from other countriesB. source ideas from other culturesC. focus on economies of scaleD. source ideas from other industriesE. reject inter-industry scalability",
      "definition": "D. source ideas from other industries"
    },
    {
      "term": "Transing is.....A. Changing flights on a long trip.B. A science fiction movie.C. Bridging of domains to cope with change.D. Not related to cross-industry innovationD. All of the above",
      "definition": "C. Bridging of domains to cope with change."
    },
    {
      "term": "Brands __________.A. signify ownershipB. help identify and differentiate a productC. load and imprint positive associationsD. act like locations in the perceptual maps of peopleE. all of the above",
      "definition": "E. all of the above"
    },
    {
      "term": "Which is not a part of Asiana-Cobra Analysis Platform?A. AsiaB. NationC. SnakeD. CompanyE. Brand",
      "definition": "C. Snake"
    },
    {
      "term": "Which of the following is not on the checklist for branding cross country extension?A. Vision of global reachB. Noon Nopi similarityC. Legal restrictionsD. Return on investmentE. Shareholders' dividends",
      "definition": "E. Shareholders' dividends"
    },
    {
      "term": "Cross Industry Branding is ________.A. the testing of products in multiple consumer segmentsB. the testing of consumers in their understanding of multiple industriesC. testing of Noon Nopi of brands in multiple industries/productsbranding across countriesD. None of above",
      "definition": "C. testing of Noon Nopi of brands in multiple industries/products"
    },
    {
      "term": "Amazon's goal to be earth's most customer-centric company is an example of _______.A. overarching visionB. Noon Nopi congruenceC. legal restrictionsD. return on investmentE. none of the above",
      "definition": "A. overarching vision"
    },
    {
      "term": "Global Marketing is _________.A. the addition of a market abroad as an extension of domestic marketingB. localizing multiple Noon Nopi levels of many different consumers across countriesC. unifying different markets into one Noon NopiD. extending our Noon Nopi to other countriesE. all of the above",
      "definition": "C. unifying different markets into one Noon Nopi"
    },
    {
      "term": "Price can be varied by ________.A. ProductB. SizeC. Target SegmentD. Brand PositioningE. All of the above",
      "definition": "E. All of the above"
    },
    {
      "term": "Which of the following is a cultural dimension according to Hofstede?A. FoodB. IndividualismC. HistoryD. ArtE. All of the above",
      "definition": "B. Individualism"
    },
    {
      "term": "Which is not a characteristic of Marketing Myopia?A. Near-sightednessB. Inability to Separate Results and ProcessC. Poor Business DefinitionD. Thinking of Long term gain over Short Term riskE. May be an unintentional result of too much Success",
      "definition": "D. Thinking of Long term gain over Short Term risk"
    },
    {
      "term": "Which is the right process of the framework?A. Vision - Strategy - ActionB. Action - Vision - StrategyC. Strategy - Vision - ActionD. Strategy - Action - VisionE. Action - Strategy - Vision",
      "definition": "A. Vision - Strategy - Action"
    },
    {
      "term": "Which of the following is NOT a type of Marketing Tsunami?A. PoliticalB. CulturalC. EconomicD. TechnologicalE. Astrological",
      "definition": "E. Astrological"
    },
    {
      "term": "Cognitive Distance _____A. Always leads to higher innovation resultsB. Always leads to lower innovation resultsC. Is optimized by balancing the increased novelty and the decreased absorptive capacityD. Is negatively related to novelty of an innovationE. Is positively related to the absorptive capacity of an innovation",
      "definition": "C. Is optimized by balancing the increased novelty and the decreased absorptive capacity"
    },
    {
      "term": "What is the main reason why we Brand?A. Because it is required by lawB. To help identify and differentiate a productC. To lower marketing costsD. To create point of parityE. None of the above",
      "definition": "B. To help identify and differentiate a product"
    },
    {
      "term": "A concern for global (standardized) branding in international marketing isA. Similar Noon Nopi of the brand equity per country or regionB. Black MarketsC. Confused buyers if brands formerly had different namesD. Low application costs of standardizing brands across countriesE. Risk of trusting business partners",
      "definition": "C. Confused buyers if brands formerly had different names"
    },
    {
      "term": "Brands are important because they _________.A. brands are inexpensive to manageB. create preferential demandC. develop a personality for consumers' home countriesD. Brand is your product or company's nameE. always create only positive associations",
      "definition": "B. create preferential demand"
    },
    {
      "term": "What is not a cost of Global (Extended) branding across industries?A. Confused buyersB. Retail ResistanceC. Helping of the parent brandD. Diminished Identity with a categoryE. None of above",
      "definition": "C. Helping of the parent brand"
    },
    {
      "term": "Which of the following is a correct pairing from Hofstede's Model?A. Individualism-Communism: : \"Me\" versus the \"We\"B. Power distance : Avoidance of powerC. Masculinity-femininity : Differentiated gender rolesD. Uncertainty avoidance : Pursue evident goalsE. Indulgence versus Restraint : Emphasis on education",
      "definition": "C. Masculinity-femininity : Differentiated gender roles"
    },
    {
      "term": "Underestimating Noon Nopi can lead to _________.A. successfully living up to consumer quality expectationsB. consumer satisfactionC. bad word of mouthD. cross industry innovationE. none of the above",
      "definition": "C. bad word of mouth"
    },
    {
      "term": "Which of the following is a Transing domain?A. FoodB. ArtC. ReligionD. EducationE. All of the above",
      "definition": "E. All of the above"
    },
    {
      "term": "Occurrences at the margin of significant environmental change or megatrend are called ____________.A. Weak signalsB. Point of DifferenceC. Point of PurchaseD. Strong signalsE. Asiana-Cobra",
      "definition": "A. Weak signals"
    },
    {
      "term": "Which of the following is the benefit of the \"Fit\" part of Transing's \"Flexible Fit\" concept?A. Maintaining existing strengthsB. Maximizing CostsC. To take more adaptive risksD. To go into new industriesE. To add new personnel",
      "definition": "A. Maintaining existing strengths"
    },
    {
      "term": "When dealing with Consumer Behavior, it is important to ___________.A. Understand consumers at the individual level and also their collective influencesB. Understand consumers at their home countries as well as abroadC. Understand consumers' consideration set and non-consideration setD. Understand consumers at their workplace and at homeE. None of the above",
      "definition": "A. Understand consumers at the individual level and also their collective influences"
    },
    {
      "term": "When utilizing VSA on a target consumer, the key objective is ____________.A. To ensure alignment of collectivism, consumer individualism, and marketing actionB. To ensure alignment of response, consumer constructs, and marketing actionC. To ensure alignment of response, consumer freedom, and marketing strategyD. To ensure alignment of collectivism, consumer constructs, and marketing strategyE. To ensure alignment of individualism, consumer freedom, and marketing action",
      "definition": "B. To ensure alignment of response, consumer constructs, and marketing action"
    },
    {
      "term": "When marketing to the \"Bottom of the Pyramid\" it is important to ____________.A. Remember that different tiers respond to marketing actions in a different wayB. Remember that Noon Nopi is the same for each level of the pyramidC. Focus more on the top of the pyramid where most of the money isD. All of the aboveE. None of the above",
      "definition": "A. Remember that different tiers respond to marketing actions in a different way"
    },
    {
      "term": "Marketing CSI is _____________.A. The art of gathering data and putting the pieces together to create a profile of your Noon NopiB. The art of gathering data and putting the pieces together to create a profile of your consumerC. The art of gathering opinions and putting the reactions together to create a profile of your country of originD. The art of gathering opinions and putting the reactions together to create a profile of your companyE. None of the above",
      "definition": "B. The art of gathering data and putting the pieces together to create a profile of your consumer"
    },
    {
      "term": "In Hidden Consumer Behavior, ____________ is a construct that occurs deep inside the minds of people.A. PerceptionB. MotivationC. LearningD. All of the aboveE. None of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "The SFU Grid is used for positioning against __________.A. CountriesB. CompetitorsC. ConsumersD. ChannelsE. Campaigns",
      "definition": "B. Competitors"
    },
    {
      "term": "The country that has opinion Leadership/Trend-setting power on other countries is called _____________.A. Advanced CountriesB. Developing CountriesC. Lead CountriesD. Developed CountriesE. Undeveloped Countries",
      "definition": "C. Lead Countries"
    },
    {
      "term": "Please choose the right sequence of the market selection process.A. Home vs. abroad -> regional selection -> country selection -> segment selectionB. Home vs. abroad -> segment selection -> country selection -> regional selectionC. Home vs. abroad -> country selection -> regional selection -> segment selectionD. Home vs. abroad -> regional selection -> segment selection -> country selectionE. Home vs. abroad -> segment selection -> regional selection -> country selection",
      "definition": "A. Home vs. abroad -> regional selection -> country selection -> segment selection"
    },
    {
      "term": "A good reason for companies to go abroad is ____________.A. To pursue higher market growthB. To plan future expansionC. To source knowledgeD. To create a better global imageE. All of the above",
      "definition": "E. All of the above"
    },
    {
      "term": "Please select the right sequence of the target selection process 1. Align selection with your VSA 2. Balance the selection criteria 3. Aggregate your segments 4. Backup \"Plan A\" with \"Plan B\" | 1-2-3-4 | 1-2-4-3 | 1-3-2-4 | 1-4-2-3 | 1-4-3-2",
      "definition": "B. 1-2-4-3"
    },
    {
      "term": "A product is _________.A. Not just tangible but also intangibleB. Something that does not satisfy a needC. A need to a meansD. Not good if it is expensiveE. None of the above",
      "definition": "A. Not just tangible but also intangible"
    },
    {
      "term": "Lego created a face for their brand by utilizing _________.A. Plastic surgeryB. Good word-of-mouthC. Trans media storytellingD. Social media marketingE. Genetic marketing engineering",
      "definition": "C. Trans media storytelling"
    },
    {
      "term": "A way that Place can help Promotion is by __________.A. Offering free deliveryB. The use of flagship storesC. Self-creating things onlineD. Renting out store space to other businessesE. All of the above",
      "definition": "B. The use of flagship stores"
    },
    {
      "term": "Value equals ________.A. Benefits - CostsB. Costs + BenefitsC. Benefits * CostsD. Costs/BenefitsE. Benefits/Costs",
      "definition": "E. Benefits/Costs"
    },
    {
      "term": "When determining relative value in pricing, it is important to approach total benefits and costs by comparing your company to _________.A. ConsumersB. ShareholdersC. Government regulatorsD. CompetitorsE. Accountants",
      "definition": "D. Competitors"
    },
    {
      "term": "Question 1In cross country social marketing, it is important to remember that __________.A. Social means online in every countryB. O2O can only mean online to offlineC. O2O can only mean offline to onlineD. O2O can mean online to offline but also offline to onlineE. O2O can mean either online to offline or offline to online, but not both",
      "definition": "D. O2O can mean online to offline but also offline to online"
    },
    {
      "term": "Question 2In cross industry Simple Marketing, the search for similarity between industries in order to simplify must be done in a ___________.A. Research labB. Simplified wayC. Cost effective wayD. Multi-level wayE. Positive way",
      "definition": "D. Multi-level way"
    },
    {
      "term": "Small Marketing is ________.A. Marketing for small marketsB. Marketing to small marketsC. Marketing by small firmsD. Targeting unpopular but potentially popular marketsE. All of the above",
      "definition": "E. All of the above"
    },
    {
      "term": "Question 4In cross country Skip Marketing, __________.A. Developed countries are always technologically superior to developing countriesB. There is no need to focus any attention on parts and componentsC. The technology used in developed countries are always obsolete in developing countriesD. There is no need to focus on the actual product because demand is universalE. None of the above",
      "definition": "E. None of the above"
    },
    {
      "term": "An important factor in cross country Screen Marketing, is ________.A. That timing does not matter across bordersB. That action movies are not popular outside of the United StatesC. The universality of the star of the movieD. That dubbing is useless but should be done to target sight-impaired consumersE. That showing at art house cinemas is important",
      "definition": "C. The universality of the star of the movie"
    },
    {
      "term": "Set Marketing is about complementary products, which are ________. | products that substitute each other | products that do not compete with each other  | products that do not compete with each other but are very rarely used together | products that are free | products that make you happy ",
      "definition": "B. Products that do not compete with each other"
    },
    {
      "term": "Sports Marketing is the ________.A. Marketing of SportsB. Marketing through SportsC. Marketing of Sports StarsD. All of the aboveE. None of the above",
      "definition": "D. All of the above"
    },
    {
      "term": "Screen Marketing can be ____________.A. hiring staff to work on moviesB. selling movies in Blu Ray formatC. the private lives of movie starsD. product placement in moviesE. all of the above",
      "definition": "D. product placement in movies"
    },
    {
      "term": "Profiling can help us in terms of understanding ____________ and guiding ____________.A. practices, financial investmentsB. foreign market local languages, marketing strategiesC. consumers, marketing strategiesD. currency, marketing strategiesE. consumers, market research",
      "definition": "C. consumers, marketing strategies"
    },
    {
      "term": "Please choose the best answer. In Market Landing Strategy, a Beachhead Market is ___________.A. the market where you bring your product after a successful test launch in a neighboring marketB. the market you strategically start with so that it will help with the future launch of your product in other countries.C. the market you have the biggest potential of selling your product due to large population and high incomeD. the market that has the best distribution network, usually one that has easy access to shipping portsE. the market that has the best infrastructure so that your product can easily be transported from the coast to the inner cities where your consumers reside",
      "definition": "B. the market you strategically start with so that it will help with the future launch of your product in other countries."
    },
    {
      "term": "Which of the following is true of the Consumer Journey alignment with Marketing Strategy?A. The Consumer Journey is not as important as the Marketing StrategyB. Marketers should proactively guide their consumers and help them clear through the hurdles at each stage of the journey.C. The evaluation of alternatives will always be a hurdleD. Information search and purchase decision is not as important as problem recognition and post-purchase behaviorE. Your POD should not benefit you",
      "definition": "B. Marketers should proactively guide their consumers and help them clear through the hurdles at each stage of the journey."
    },
    {
      "term": "In Price Marketing, Price can help Promotion ____________.A. because price is the \"lazy marketer's advertising\"B. because high price can be a good positioning if backed up by good productC. because price cuts, if planned well, is part of quick sales promotionD. all of the aboveE. none of the above",
      "definition": "D. all of the above"
    },
    {
      "term": "Question 8In Cross Industry Sports Marketing, it is important to differentiate _____________.A. spectator vs. participantB. entertainment vs. allegianceC. fan vs. rivalD. participant vs. performanceE. entertainment vs. spectator",
      "definition": "A. spectator vs. participant"
    },
    {
      "term": "When the VSA Module is utilized on a targeted consumer, the underlying consumer behavioral constructs are ___________.A. what we want our consumers to feel or say about our productsB. the 4P's of marketingC. what type of responses we are getting from our consumersD. the lowest level of the module where we are determining which actions we should takeE. what drives the responses we get from our consumers",
      "definition": "E. what drives the responses we get from our consumers"
    },
    {
      "term": "Which of the following is true in Cross Industry Place Marketing?A. New technology helps efficiency of service add-ons.B. Service add-ons innovations can be sourced from a wide range of countries.C. New technology helps efficiency of market research.D. New markets help efficiency of service add-ons.E. Service add-ons innovation are never sourced from a wide range of industries.",
      "definition": "A. New technology helps efficiency of service add-ons."
    },
    {
      "term": "In Market Targeting, which of the following is a criteria that should be balanced?A. Present and FutureB. External and InternalC. Global and LocalD. Quantitative and QualitativeE. All of the above",
      "definition": "E. All of the above"
    },
    {
      "term": "When positioning against competitors it is good to _________.A. push out weak associations, pull up your SUU associations for POD, and pump up your SFU associations for POPB. push out strong associations, pull up your SUU associations for POD, and pump up your SFU associations for POPC. push out strong associations, pull up your SUU associations for POP, and pump up your SFU associations for PODD. push out weak associations, pull up your SUU associations for POP, and pump up your SFU associations for PODE. concentrate on strong associations, pump up your SUU associations for POP, and push out your SFU associations for POD",
      "definition": "D. push out weak associations, pull up your SUU associations for POP, and pump up your SFU associations for POD"
    },
    {
      "term": "Please pick the best answer. What is Skip Marketing?A. The leapfrogging of technology in developing markets due to technology becoming more accessible and less costly over time.B. The leapfrogging of technology in developed markets because they are wedded to their old infrastructure.C. The leapfrogging of technology due to technology having higher costs over time.D. The skipping of marketing content.E. The skipping of neighboring countries in your marketing strategy in order to disperse knowledge of your product through limited resources.",
      "definition": "A. The leapfrogging of technology in developing markets due to technology becoming more accessible and less costly over time."
    },
    {
      "term": "Which of the following is true when adjusting Noon Nopi to the Bottom of the Pyramid?A. What we are selling should not be based on the customer need.B. Trust is important in developing countries.C. Consumers in developing countries usually do not have access to cash due to few ATM locations and so attention should be more focused on credit card purchases.D. Distribution costs are usually low in developing countries.E. None of the above",
      "definition": "B. Trust is important in developing countries."
    },
    {
      "term": "An orange juice company providing a coupon for bacon is an example of _________.A. cross country promotionB. cross brandingC. cross mediaD. cross promotionE. cross analysis promotion",
      "definition": "D. cross promotion"
    },
    {
      "term": "Which of the following is a good practice when attempting radical repositioning?A. Hire \"yes\" men as staff so that things will move ahead fasterB. Create a Doppelganger mindset to keep your thoughts in check and not be too radicalC. Hire \"no\" men as staff in order to ensure group-thinkD. Never insource creativityE. Make a movie to construct and produce a creative narrative for your company.",
      "definition": "E. Make a movie to construct and produce a creative narrative for your company."
    },
    {
      "term": "Which of the following is NOT Simple Marketing?A. Matching simple Noon Nopi levels of consumersB. DivergenceC. No frills marketingD. Economy oriented marketingE. Convergence",
      "definition": "B. Divergence"
    },
    {
      "term": "When comparing \"Product\" between Tier 1 and Tier 5 of the Pyramid, it is important to know that __________.A. service is usually an augmented product that can help in increasing price in Tier 1 but might be a hard-to-sell proposition in Tier 5B. products compete against competitors' products in Tier 1 but competitors work together in Tier 5C. distributing the products have high costs in Tier 1 but low costs in Tier 5D. products in general are harder to sell in Tier 1 than Tier 5 due to low labor costs in Tier 1E. service is usually easier to sell in Tier 5 due to the higher growth rates and potential of developing countries",
      "definition": "A. service is usually an augmented product that can help in increasing price in Tier 1 but might be a hard-to-sell proposition in Tier 5"
    },
    {
      "term": "A positive way that Product can help Price is ________.A. product costs can increase priceB. branding and packaging decreases price wiggle roomC. an oversupply of product will increase priceD. an under demand for product will increase priceE. product quality can increase price",
      "definition": "E. product quality can increase price"
    },
    {
      "term": "When aligning your STP with your VSA, it is important to keep in mind that ___________.A. it is good to just focus on one targetB. your vision requires future orientationC. your segment cannot be your PODD. transing with flexible fit will make you avoid diversified choicesE. None of the above",
      "definition": "B. your vision requires future orientation"
    },
    {
      "term": "In Small Marketing, it is important to keep in mind that _________.A. small markets only have small potential but also small riskB. small markets and investments can be influential and have huge potential if targeting is done wellC. small investments have small returns and so are usually only done by small companiesD. small markets are not influential but small investments have huge potential if targeting is done wellD. small investments have small potential but small markets can be influential if targeting is done well",
      "definition": "B. small markets and investments can be influential and have huge potential if targeting is done well"
    },
    {
      "term": "In Cross Country Product Marketing, it is important to not __________.A. assume that the mix of tangible and intangible aspects will be the same across countriesB. turn away consumers that may not be aware of the product's functionsC. focus on Noon NopiD. pick a country with too little cognitive distanceE. use a different product or service for a common need",
      "definition": "A. assume that the mix of tangible and intangible aspects will be the same across countries"
    },
    {
      "term": "Which of the following is true about Cross Industry Social Marketing?A. Social is only onlineB. Social is only offlineC. Social is social no matter online or offlineD. Innovation can only occur in one directionE. Innovation can only occur online",
      "definition": "C. Social is social no matter online or offline"
    },
    {
      "term": "A common misperception of B2B Marketing is that _______.A. B2B Marketing is ultimately B2B2C MarketingB. B2B Marketing is rather simple when compared to B2C MarketingC. B2B Marketing stands for Business to Business MarketingD. B2B Marketing involves Buying Centers and Selling CentersE. B2B Marketing is like a team sport",
      "definition": "B. B2B Marketing is rather simple when compared to B2C Marketing"
    },
    {
      "term": "Please choose the right explanation. In B2B Marketing, _____________.A. our buyers are a reflection of the selling companyB. our buyers are other businessesC. our buyers are various departments in a businessD. B2B is actually B2B2CE. all of the above",
      "definition": "E. all of the above"
    },
    {
      "term": "In B2B Marketing, __________.A. relationships matter more so than in B2C Marketing because there are fewer and larger customersB. relationships do not matter when dealing with \"In-Suppliers\" and GatekeepersC. relationships matter because they raise costsD. similar functional backgrounds are not importantE. personal ties are not important",
      "definition": "A. relationships matter more so than in B2C Marketing because there are fewer and larger customers"
    },
    {
      "term": "The 4W's in the 4W Approach ________.A. are all always involved in every stageB. includes who is involved in the selling centerC. includes what the member wants in terms of incentivesD. includes when the buying center should walk away from a dealE. includes the weight or voice that the member of the buying center carries",
      "definition": "E. includes the weight or voice that the member of the buying center carries"
    },
    {
      "term": "In B2B Marketing, the member of the Buying Center that controls the access or information to other members such as the key decision maker is known as the __________.A. goalkeeperB. producerC. initiatorD. influencerE. gatekeeper",
      "definition": "E. gatekeeper"
    },
    {
      "term": "When the B2B process is formalized, early vendor involvement is good because __________.A. stage 1 is when you have the most competition and hence lower pricesB. there is less leeway early onC. you can be less proactive and still have good results early on but not in later stagesD. the window of opportunity gets smaller as you wait longer to enterE. early to production and early to market, makes a product a dull product",
      "definition": "D. the window of opportunity gets smaller as you wait longer to enter"
    },
    {
      "term": "In B2B2C Pull and Push, _________.A. you should always take a push or pull strategy as opposed to a push and pull strategyB. push involves the manufacturer reaching a consumer directlyC. pull involves the manufacturer reaching a consumer through other peopleD. pull enabled push strategy can make marketing easierE. pull enabled push strategy is rarely recommended",
      "definition": "D. pull enabled push strategy can make marketing easier"
    },
    {
      "term": "What is one of the key implications of the Total Product System (TPS)? | It is an individual, single stage approach | Pre-marketing can lock-in buyers | Differentiation is achieved only at the tangible product stage | Post-marketing is irrelevant and shouldn’t be done | All of the above",
      "definition": "Pre-marketing can lock-in buyers"
    },
    {
      "term": "In B2B marketing, it is important to focus on _____? | Buyer’s benefit and cost analysis only in order to be as desirable as possible | Both buyer’s benefits and costs analysis as well as your own cost portfolio | Your own (supplier’s) cost and benefit portfolio | One single vertical segment only in order not to create confusion among suppliers or buyers     | None of the above",
      "definition": "Both buyer’s benefits and costs analysis as well as your own cost portfolio"
    },
    {
      "term": "What is a feature of pricing in the price concept? | The total “pay” is out of pocket | Price is set by the supplier, and has the same value for every buyer | Prices always end in a '9' ($9.99 instead of $10, $99 instead of 100)     | Price is value that may involve non-price factors also  | None of the above",
      "definition": "Price is value that may involve non-price factors also"
    },
    {
      "term": "In cross country growth, some of the opportunities that we could see are _____? | Demand-related in terms of adding markets and adding image | Supply-related in terms of increasing scalability | Supply-related in terms of securing technology | Supply-related in terms of securing supply | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "In determining the total value of your offering in B2B pricing it is important to consider _____? | Only the inferior and superior PODs of your benefits and costs | Only the inferior PODs of your benefits and costs | The POP and POD of your benefits and and costs | Only the superior PODs of your benefits and costs | The superior POD of your benefits and the inferior POD of your costs",
      "definition": "The POP and POD of your benefits and and costs"
    },
    {
      "term": "Total Costs of Ownership (TCO) refers to _____? | The upfront costs a customer has to bare | The disposal costs a customer has to bare | The aggregate of direct and indirect costs a customer has to bear over the lifetime of a product's use | The operation costs a customer has to bare | None of the above",
      "definition": "The aggregate of direct and indirect costs a customer has to bear over the lifetime of a product's use"
    },
    {
      "term": "In determining a sales and distribution strategy, it is important to consider that _____? | Different types of customers call for different types of distribution and sales strategy  | Different types of customers call for different types of distribution strategy, but the same sales strategy | Different types of customers call for the same distribution strategy, but different sales strategy | Different types of customers call for the same type of distribution and sales strategy | It completely depends on the industry that you are in",
      "definition": "Different types of customers call for different types of distribution and sales strategy"
    },
    {
      "term": "Quiz type: radio, With low cultural distance, what is generally the best way to grow to a new country? | Indirect export | License | Joint Venture | Locally Produce | None of the above",
      "definition": "Locally Produce"
    },
    {
      "term": "Quiz type: radio, In determining a channel strategy _____? | We should first determine the buyer’s service needs | Direct selling is optimal when the service providing capability is low | It is wiser to choose a full function indirect selling method when we are looking for a specialized distribution channel | We should go for indirect selling when our service capability is high | We first need to determine whether we want to do direct or indirect selling",
      "definition": "We should first determine the buyer’s service needs"
    },
    {
      "term": "Quiz type: radio, An important aspect in B2B Pricing is adding value. What are some important features of adding value? | Depending on the future usage value of the product, the segment and price can be different | It is important to help solve problems and lock in buyers through Early Vendor Involvement (EVI) | Having the same pricing strategy regardless of segment and future application eg. Adhesives | Answers (1) and (2) only | All of the above",
      "definition": "Answers (1) and (2) only"
    },
    {
      "term": "Quiz type: radio, According to the B2B Definition-based Growth Matrix, what is an example of a new diagonal? | New application, same product     | Same application, same product  | Same application, new product      | New application, new product  | None of the above",
      "definition": "New application, new product"
    },
    {
      "term": "Quiz type: radio, The ideal segment cost portfolio is ______. | A predominantly high cost and low price | A predominantly high cost and high price | A predominantly low cost and high price  | A predominantly low cost and low price | This is a trick questions! There is no ideal segment cost portfolio",
      "definition": "A predominantly low cost and high price"
    },
    {
      "term": "Quiz type: radio, What plays a key role in place marketing? | A direct channel between the manufacturer and the buyer is always used  | Service is always separate from the product itself      | Location, but not time, variety, quantity or customization      | It is important to consider the set of service add-ons to help smooth out seller and buyer Noon Nopi gaps | All of the above",
      "definition": "It is important to consider the set of service add-ons to help smooth out seller and buyer Noon Nopi gaps"
    },
    {
      "term": "Quiz type: radio, Selling Centers are important because salespersons _____?  | Should only be concerned with their numbers | May not know as much about organizational culture | Should not have to deal with the actual product     | May need cross functional integration | All of the above",
      "definition": "May need cross functional integration"
    },
    {
      "term": "Total Marketing is when __________.A. individual play and team play are utilized togetherB. is about winning by the selling company instead of who does the scoringC. marketing is done not just by the marketing departmentD. all of the aboveE. none of the above",
      "definition": "D. all of the above"
    },
    {
      "term": "The different roles of a Buying Center consists of departments and positions but also the ___________.A. Buyer, Influencer, Goalkeeper, and DeciderB. Buyer, Initiator, Goalkeeper, and DeciderC. Influencer, Initiator, Gatekeeper, and DefenderD. Influencer, Initiator, Gatekeeper, and DeciderE. Buyer, Influencer, Gatekeeper, and Defender",
      "definition": "D. Influencer, Initiator, Gatekeeper, and Decider"
    },
    {
      "term": "In B2B product variation __________.A. hybrid products enjoy the advantages of costs and perceived valueB. one should assume that all products have to be custom designedC. B2B products are never like B2C products and so should not be marketed in the same wayD. there is a very narrow distribution when it comes to characteristics of B2B productsE. none of the above",
      "definition": "A. hybrid products enjoy the advantages of costs and perceived value"
    },
    {
      "term": "In advertising, vertical vehicles are _________.A. non-industry specificB. a way of measuring how high the ads reach in the food chainC. a way of measuring repetitionD. specialized to one industryE. catered specifically to the petrol industry for cars",
      "definition": "D. specialized to one industry"
    },
    {
      "term": "Which of the following it NOT a component In B2B2C Pricing?A. Value adding to the buyerB. Value adding to the end userC. Seller cost reductionD. Buyer cost reductionE. None of the above",
      "definition": "E. None of the above"
    },
    {
      "term": "Which of the following is an example of direct selling?A. Distributors selling products to retailersB. Online selling from the manufacturer's websiteC. Agents making sales off commissionD. Manufacturer representatives making salesE. Brokers getting products placed in department stores",
      "definition": "B. Online selling from the manufacturer's website"
    },
    {
      "term": "Which of the following is true about Total Product System (TPS) Marketing?A. TPS is an individual level team approachB. POD can only be achieved at the main marketing stageC. Pre-marketing can lock-in buyersD. Post-marketing is not profitable but good to do as a courtesyE. TPS has only a single component",
      "definition": "C. Pre-marketing can lock-in buyers"
    },
    {
      "term": "Total Costs of Ownership (TCO), ___________.A. includes upfront costs and installation costs but not disposal costs because some products have no resale valueB. includes the lifetime costs that the owner of a product must deal withC. does not include switching costsD. includes operation costs but not installation costsE. only includes upfront costs, operation costs, and disposal costs",
      "definition": "B. includes the lifetime costs that the owner of a product must deal with"
    },
    {
      "term": "Which of the following is NOT true? Personal selling considerations include, _________. | hiring the right people and training them well | motivating your employees to do the best job possible | strategic account selling | sales force automation | segmenting amongst our customers to find out which segments we should just drop completely since only focusing on one segment is the best strategy",
      "definition": "E. segmenting amongst our customers to find out which segments we should just drop completely since only focusing on one segment is the best strategy"
    },
    {
      "term": "Which of the following is NOT true when building the Value Stack?A. It is important to beware that different units of a customer firm may perceive or receive only a portion of an offering's total valueB. Marketers create a value stack by educating B2B customers on the total value of the offering to their firmC. Sometimes it is important to have different value stack configurations catered to different buying center membersD. Sometimes it is important to eliminate units in a configuration when dealing with small to medium sized companiesE. None of the above",
      "definition": "E. None of the above"
    },
    {
      "term": "In B2B Promotion Marketing, _________.A. much like boxing, the proper communication steps should be set up before the closing knockout punchB. the cumulative promotional efficiency is not important if the per-stage efficiency is highC. much like boxing, one should always first start with the knockout punch to fake the opponent and prevent a counter punchD. there is no proper sequence of Attention, Interest, Desire, and ActionE. the order of Attention and Action is interchangeable and so should be switched around often",
      "definition": "A. much like boxing, the proper communication steps should be set up before the closing knockout punch"
    },
    {
      "term": "Channel costs in B2B Marketing, ___________.A. are always the same between direct and indirect channelsB. direct channels have high variable costsC. indirect channels have lower fixed costsD. direct channels have lower fixed costsE. indirect channels have lower variable costs",
      "definition": "C. indirect channels have lower fixed costs"
    },
    {
      "term": "Going abroad can allow/require your company to...?A. ...add to salesB. ...raise cost and, hence, reduce profitabilityC. ...lower costsD. ...make certain adaptations and localizations of the productE. ...all of the above",
      "definition": "E. ...all of the above"
    },
    {
      "term": "How are boxing and promotion related?A. Like in boxing, the main goal of promotion is to fight your competitionB. Like in a boxing ring where movement is very limited, the choices for a promotion mix should also be as limited as possibleC. Like in boxing, promotion also demands a combination of different \"punches\" to set up the buyer for businessD. Like in boxing, it is necessary to be a big and strong company in order to be successfulE. None of the above...boxing and promotion are obviously not related!",
      "definition": "C. Like in boxing, promotion also demands a combination of different \"punches\" to set up the buyer for business"
    },
    {
      "term": "In order to \"win\" in promotion, you have to gain (1)_____, gain (2)______, and gain (3)______ before being able to \"close\" with Action.A. Offers...investments...knowledgeB. Attention....interest....desireC. Trust...money...courageD. Experience...expertise...expectationsE. None of the above",
      "definition": "B. Attention....interest....desire"
    },
    {
      "term": "B2B promotion should generally not _____?A. achieve multiple communication goalsB. advertise execution alignmentC. move the buyer along the AIDA to ABCD. promote using a wide promotion mixE. rely on one tool for promotion",
      "definition": "E. rely on one tool for promotion"
    },
    {
      "term": "When expanding abroad, it is important to _____?A. Consider your supply vendor qualificationB. Strictly maintain original business culture in order not to change the product offeringC. Only worry about other foreign competitorsD. Apply the same type of regulation as country of originE. Shift exact production, distribution and manufacturing methods, regardless of local infrastructure",
      "definition": "A. Consider your supply vendor qualification"
    },
    {
      "term": "A measuring tool for differences in local business culture to consider is called _____?A. Hofstede Cultural Dimension TheoryB. Herd BehaviorC. STP AnalysisD. Diversity Marketing ToolE. None of the above",
      "definition": "A. Hofstede Cultural Dimension Theory"
    },
    {
      "term": "Quiz type: radio, When a customer buys a service product, compared to buying a goods product, what does the customer really buy? | Functions | Benefits | Features | Utility",
      "definition": "Benefits"
    },
    {
      "term": "Quiz type: radio, Which one of the following is not a unique characteristic of services? | Credibility | Perishability | Intangibility | Simultaneity",
      "definition": "Credibility"
    },
    {
      "term": "Quiz type: checkbox, What are the management challenges associated with the fact that customers are present, participate, or co-create values during the service delivery process? Choose the two most applicable ones. | Designing the task of service employees | Designing the physical environment (servicescape) of the service delivery | Designing the role of service employees | Designing the role of customers",
      "definition": "Designing the role of service employees | Designing the role of customers"
    },
    {
      "term": "Quiz type: checkbox, Why is balancing supply and demand so challenging for services? Choose the two most applicable causes. | Because customer needs are so peculiar. | Because services cannot be pre-produced and inventoried. | Because service employees are humans. | Because demand is highly time-variable while supply is relatively fixed over time.",
      "definition": "Because services cannot be pre-produced and inventoried.|Because demand is highly time-variable while supply is relatively fixed over time."
    },
    {
      "term": "Quiz type: radio, Offering service guarantees to customers is a way to preempt customer demand. What is the unique characteristic of services that triggers service managers' interest in offering such guarantees? | Perishability  | Intangibility | Simultaneity | Heterogeneity",
      "definition": "Intangibility"
    },
    {
      "term": "Quiz type: radio, According to the lecture, what causes customer evaluation to differ so widely across different customers for an identical service delivered by the same person in the same way at the same level of quality? | Price | Location | Customer expectation | Servicescape",
      "definition": "Customer expectation"
    },
    {
      "term": "Quiz type: radio, How is a service customer's satisfaction determined? | By the customer's mood | By the quality level of service delivered | By the difference between customer expectation and customer perception | By the difference between customer perception and service employee perception",
      "definition": "By the difference between customer expectation and customer perception"
    },
    {
      "term": "Quiz type: text, Is the following sentence true or false? In managing the quality of service, prevention is the only way to ensure quality.  | ",
      "definition": "False"
    },
    {
      "term": "Quiz type: text, Is the following sentence true or false? Early bird specials offered by a restaurant are a way to cope with the perishability characteristic of a service business.  | ",
      "definition": "True"
    },
    {
      "term": "Is the following sentence true or false? Service customers use servicescape as a clue for the quality of service. | ",
      "definition": "True"
    },
    {
      "term": "Quiz type: text, Is the following sentence true or false? Airlines are better off by selling airplane seats, which would otherwise go unsold, at a price higher than the variable cost of selling a seat than not selling it at all.  | ",
      "definition": "True"
    },
    {
      "term": "Quiz type: text, Is the following sentence true or false? Perceived service quality is same as the reality of the service.  | ",
      "definition": "False"
    },
    {
      "term": "Quiz type: radio, Which one of the following does not belong to the hospitality industry? | Hotels | Restaurants | Hospitals | Cruises",
      "definition": "Hospitals"
    },
    {
      "term": "Quiz type: checkbox, What are the common characteristics of businesses in the hospitality industry? Choose all that apply. | Highly time-variable demand | Low fixed cost and high variable cost | Relatively fixed capacity | Perishable inventory",
      "definition": "Highly time-variable demand|Relatively fixed capacity|Perishable inventory"
    },
    {
      "term": "Quiz type: checkbox, Most hospitality businesses sell through advance reservations. What are the upsides of this characteristic? Choose all that apply. | Can have unexpected availability of inventory due to cancellations and/or no-shows. | Can act proactively about balancing supply and demand. | Can differentiate service offerings. | Can better predict demand.",
      "definition": "Can act proactively about balancing supply and demand.|Can differentiate service offerings.|Can better predict demand."
    },
    {
      "term": "Quiz type: checkbox, One of the common characteristics of hospitality businesses is that their market is segmentable. In other words, customers can be grouped into different segments. What are the important differences among different segments that matter to the successful marketing of the business? Choose all that apply. | Difference in the level of uncertainty of the use | Difference in the preferred time of consumption | Difference in the flexibility with the time of consumption | Difference in the perceived value of an essentially same product | Difference in the ability to plan in advance",
      "definition": "Difference in the preferred time of consumption|Difference in the flexibility with the time of consumption|Difference in the perceived value of an essentially same product"
    },
    {
      "term": "Quiz type: text, Fill in the blanks in the following sentence: Variable pricing approach recommends that businesses charge different prices to different customers for essentially same product because different customers are willing to pay different prices due to different ___ (one word)___ and ___(two words)___ of the product. | ",
      "definition": "prices"
    },
    {
      "term": "Quiz type: checkbox, How does variable pricing approach increase revenue compared to using fixed pricing approach? Choose all that apply. | By charging a lower price to everyone | By charging a higher price to customers who are willing to pay higher price | By capturing more demand by charging lower prices to those who are not willing pay regular prices | By charging a higher price to everyone",
      "definition": "By charging a higher price to customers who are willing to pay higher price|By capturing more demand by charging lower prices to those who are not willing pay regular prices"
    },
    {
      "term": "Quiz type: text, Is it true or false. Preventing customers who are willing to pay a higher price from paying a lower price is the biggest challenge in successfully moving from fixed pricing to variable pricing. | ",
      "definition": "true"
    },
    {
      "term": "Quiz type: checkbox, What is the rate fence in variable pricing? Choose all that apply. | It is a set of characteristics that distinguish customers from one segment from another. | It is a set of characteristics that distinguish customers from one industry from another. | It is a set of conditions that make it very hard to apply variable pricing. | It is a set of conditions that have to be satisfied in order for a lower price to be allowed.",
      "definition": "It is a set of characteristics that distinguish customers from one segment from another.|It is a set of conditions that have to be satisfied in order for a lower price to be allowed."
    },
    {
      "term": "Quiz type: radio, Chef's table is an example of ______________________. | Premium pricing | Target discounting | Broad-scale discounting | Fixed pricing",
      "definition": "Premium pricing"
    },
    {
      "term": "Quiz type: text, Is it true or false? Broad-scale discounting is a bad idea because it makes people who are willing to pay a higher price pay a lower price. | ",
      "definition": "true"
    },
    {
      "term": "Quiz type: radio, A weekend get-away package for locals is a good example of ___________. | Broad-scale discounting | Target discounting | Premium pricing | Fixed pricing",
      "definition": "Target discounting"
    },
    {
      "term": "Quiz type: text, Is the following sentence true or false? Coordination of efforts between marketing team and operations team is an essential component for the successful implementation of target discounting. | ",
      "definition": "true"
    },
    {
      "term": "Quiz type: radio, Which one of the following is not true of the healthcare industry? | It is one of the fastest growing industries in the world. | It is one of the largest industries in the world. | It is one of the most profitable industries in the world. | It is the sum of sector that provide goods or services to treat patients with care.",
      "definition": "It is one of the most profitable industries in the world."
    },
    {
      "term": "Quiz type: radio, Which one of the following is not the aspect that distinguishes the healthcare industry from other service industries? | The emotional state of customers is largely negative. | The industry offers something customers do not want to have to need. | Customers' assessment of the outcome is very objective. | Customers are sensitive to and easily influenced by what others say and do to them.",
      "definition": "Customers' assessment of the outcome is very objective."
    },
    {
      "term": "Quiz type: radio, Which one of the following does the malpractice example used in the lecture illustrate the importance of managing? | Patient's compliance with the instructions from the doctor | Doctor's qualification such as the number of years in practice | Patient's role during the service delivery process | Doctor's interaction with patients",
      "definition": "Doctor's interaction with patients"
    },
    {
      "term": "Quiz type: undefined, Is the following sentence true or false? It is the patient experience beyond patient service that has to be well managed for competitive advantage in the healthcare industry. | ",
      "definition": "True"
    },
    {
      "term": "Quiz type: radio, Easy access to the healthcare facility, shortened waiting time, and friendly staff compose which one of the following qualities of healthcare services? | Technical quality | Value-added service quality | Holistic patient experience quality",
      "definition": "Value-added service quality"
    },
    {
      "term": "Quiz type: checkbox, Managing patient experience requires care that addresses every aspect of the patient's encounter with the clinic including ___________. Choose all the words that can fill in this blank. | Educational needs | Spiritual needs | Physical comfort. | Emotional needs",
      "definition": "Educational needs|Spiritual needs|Physical comfort.|Emotional needs"
    },
    {
      "term": "Quiz type: radio, Shouldice Hospital was shown as a good example of a hospital with a successful patient experience design and management. Why was offering only double-occupancy rooms considered a good idea for managing patience experience? | Because it allows patients to look out for each other for emergency situations. | Because it can help patients help each other address spiritual needs. | Because it can help patients help each other address emotional needs. | Because it reduces operating costs for Shouldice.",
      "definition": "Because it can help patients help each other address emotional needs."
    },
    {
      "term": "Quiz type: checkbox, Why does managing patients' interactions with others in the hospital matter to the hospital? | Because patients do not want interactions with others in the hospital. | Because patients want others to be always around them in the hospital. | Because the quality of the interactions influence patients' satisfaction with the service at the hospital | Because it increases revenue for the hospital.",
      "definition": "Because the quality of the interactions influence patients' satisfaction with the service at the hospital"
    },
    {
      "term": "Quiz type: undefined, Is the following sentence true or false? It is not only the direct interactions but also indirect interactions of patients with others in the hospital that influence patients' satisfaction. | ",
      "definition": "True"
    },
    {
      "term": "Quiz type: checkbox, In the case of in-patients, which one of the following is a good idea to faciliate interactions among patients? Choose all that apply. | Transparent walls of patient lounges | Patient orientation program at the beginning of the hospitalization process | Group exercise sessions | Group surgery",
      "definition": "Transparent walls of patient lounges|Patient orientation program at the beginning of the hospitalization process|Group exercise sessions"
    },
    {
      "term": "Quiz type: checkbox, Which one of the following is not a key design element of healthcare facilities? Choose all. | Lighting | Color | None of above | Furniture",
      "definition": "None of above"
    },
    {
      "term": "Quiz type: radio, What is the \"positive distraction\" as a design element of healthcare facilities? | Simple distraction of patient attention from worries, concerns and pains | Disruptive elements such as noise | Servicescape elements that make patients want to linger around longer in the hospital | Facility design elements that make patients dislike the hospital",
      "definition": "Simple distraction of patient attention from worries, concerns and pains"
    },
    {
      "term": "Quiz type: radio, The stethoscope shaped like a teddy bear is a good example of _______-centered healthcare. What is the right word to fill in this blank? | Fun | Human | Service | Patient",
      "definition": "Patient"
    },
    {
      "term": "Quiz type: radio, Local Adaptation of sports sponsorship increases when___? | Sports property has only global supporters | Sports property has only global ingredients | There is a good balance between global and local sensibilities | Local market does not have purchasing power of sponsoring product | All of the above",
      "definition": "There is a good balance between global and local sensibilities"
    },
    {
      "term": "Quiz type: radio, In trying to obtain fandom, sports teams can employ which model for guidance? | Fandom Model | Fan Identification Model  | Fan Creation Framework | Managerial Correlates Model | Fantasy Football Model",
      "definition": "Fan Identification Model"
    },
    {
      "term": "Quiz type: radio, One way of measuring influence from an individual athlete is ____? | Value per tweet | Online Engagement | Athlete Engagement | Facebook follower amount | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "Quiz type: radio, Which of the following is NOT a characteristic of storytelling? | Storytelling must be formulated | Storytelling is content with context | Storytelling is limited to sports | Storytelling can be interactive | Storytelling can be very effective marketing",
      "definition": "Storytelling is limited to sports"
    },
    {
      "term": "Quiz type: radio, According to John Davis, why is sports marketing so important in branding? | Because sports are watched by a lot of people | Because sports marketing is always cheap  | Because through fandom, there are deeper positive associations and loyalty | Because sports are fun | All of the above",
      "definition": "Because through fandom, there are deeper positive associations and loyalty"
    },
    {
      "term": "Quiz type: radio, The line between a spectator and a participant in sports overlaps.. | Never | Depending on the sport. | Always | All of the above. | None of the above.",
      "definition": "Depending on the sport."
    },
    {
      "term": "Quiz type: radio, Because different consumers in sports seek different benefits, the key marketing implication is__________ | Sports marketing is simple.  | Sports marketing is unmanageable.  | We need to try to reach as many different consumers with the same benefit as we can. | We need to match the Noon Nopi to the specific consumer. | None of the above.",
      "definition": "We need to match the Noon Nopi to the specific consumer."
    },
    {
      "term": "Quiz type: radio, Which of the following is not one of the \"4M's\" of Influence Marketing? | Monopolize | Make | Manage | Monitor | Measure",
      "definition": "Monopolize"
    },
    {
      "term": "Quiz type: radio, Why is the analogy of a small fish appropriate to understand sports sponsorship? | Because sponsors are like \"fish out of water.\"  | Because a sporting property is like a small fish compared to the bigger fish, the corporate sponsor.  | Because sports sponsorship is like fishing and you need to sell your brand when the fish is fresh. | Because a sponsor is like a small fish who wants to use a bigger fish, a sport, that ultimately attracts the attention of the biggest fish, the global consumer. | All of the above.",
      "definition": "Because a sponsor is like a small fish who wants to use a bigger fish, a sport, that ultimately attracts the attention of the biggest fish, the global consumer."
    },
    {
      "term": "Quiz type: radio, If you as a sporting organization have the vision to make sports more affordable to fans, which of the following strategies and actions is NOT aligned with that VSA? | Build more VIP Sky boxes to earn higher revenues. | Offer discounts for family spectators. | Build more upper deck seats for fans. | All of the above. | None of the above. ",
      "definition": "Build more VIP Sky boxes to earn higher revenues."
    },
    {
      "term": "Quiz type: radio, Which of the following is NOT an advantage of placement? | Exposure and frequency | Support for other media | Association/Image transfer | Higher defense against attention to brands by consumers | Bypass regulation",
      "definition": "Higher defense against attention to brands by consumers"
    },
    {
      "term": "Quiz type: radio, Creativity is about aligning __________ and __________ to solve problems. | idea, execution      | idea, explanation | idols, admirers | ideals, explanations | ideals, execution",
      "definition": "idea, execution"
    },
    {
      "term": "Quiz type: radio, What is Over the Top TV? | “In your face” type of TV | A new type of projection TV | Advanced hardware additions to cable TV set top boxes that allow more content | Direct to consumer internet delivery of content without need for cable/satellite subscriptions      | All of the above",
      "definition": "Direct to consumer internet delivery of content without need for cable/satellite subscriptions"
    },
    {
      "term": "Quiz type: radio, Which of the following is False? In entertainment, content ___________. | is king | can be branded through product placement | is becoming a key issue offline but not online      | can be user generated | none of the above",
      "definition": "is becoming a key issue offline but not online"
    },
    {
      "term": "Quiz type: radio, In the Show Business Brand Relationship Model, you have consumers create, participate, interact, and experience the element of Show Business through _________. | the brand      | the 4P’s | the personnel | distribution channels | eye-catching advertising",
      "definition": "the brand"
    },
    {
      "term": "Quiz type: radio, Why is holding attention among a \"crowd of one\" important in entertainment? | As entertainers we have to care even for one person.  | We may being talking about a crowd called one. | Entertainment is a lonely profession.  | Holding attention is too difficult for a crowd bigger than one. | Because with online media a crowd of one can ultimately be a crowd of many. ",
      "definition": "Because with online media a crowd of one can ultimately be a crowd of many."
    },
    {
      "term": "Quiz type: radio, Disney's practice of having even their top executives don costumes has the intended effect of... | Embarrassing their senior employees. | Making them experience the joy and difficulty of engaging customers firsthand. | Having them practice their acting skills.  | Not taking their customers seriously.  | All of the above. ",
      "definition": "Making them experience the joy and difficulty of engaging customers firsthand."
    },
    {
      "term": "Quiz type: radio, What is the key benefit of a technology like a Hologram when used for a concert? | You can have a broader global reach in a more engaging and life-like way.  | You can physically interact with the artist. | It is like watching a concert on TV. | You can hear the music in surround sound.  | You can see it in HD color. ",
      "definition": "You can have a broader global reach in a more engaging and life-like way."
    },
    {
      "term": "Quiz type: radio, With viral marketing why does crowdsourcing ideas need to be controlled? | Because crowds are unruly. | Because crowds are not creative.    | Because crowds are too creative.   | Because the ideas from crowds may not match the vision and strategy of the creative content.  | None of the above.",
      "definition": "Because the ideas from crowds may not match the vision and strategy of the creative content."
    },
    {
      "term": "Quiz type: radio, In OTT TV, cannibalization for cable TV companies means... | The loss of their subscribers and viewers for their cable channels if they offer OTT TV themselves. | The loss of personnel to OTT TV. | The loss of viewers of viewers for broadcast channels. | The loss of advertisers for OTT TV. | All of the above.",
      "definition": "The loss of their subscribers and viewers for their cable channels if they offer OTT TV themselves."
    },
    {
      "term": "Quiz type: radio, What is one of the guidelines for country/city sports marketing? | Determining the SFU associations | Not allowing flexibility to official sponsors/partners in order to maintain power and control | Focusing solely on sports will drive all other success | It does not matter which sport is prioritized, as long as it is a sport | All of the above",
      "definition": "Determining the SFU associations"
    },
    {
      "term": "Quiz type: radio, What is NOT one of the 4 A's of Sports Sponsorship? | Awareness | Attitude | Achievement | Activation | Adaptation",
      "definition": "Achievement"
    },
    {
      "term": "Quiz type: radio, What is NOT an example of a long term objective of sponsorship? | Create an emotional bond with target consumers | Establish goodwill with society | Meet competitive threats | Establish brand SFU image | All of the above",
      "definition": "Meet competitive threats"
    },
    {
      "term": "Quiz type: radio, What is an aspect of formulating a good narrative? | Develop your plot | Define your character | Anticipate the climax | Drive home the conclusion | All of the above",
      "definition": "All of the above"
    },
    {
      "term": "Quiz type: radio, What is BIRGing? | Basking in related glory | Cutting off related failure  | Deciding who the manager of the team should be | Deciding who to purchase as a new addition to your team | All of the above",
      "definition": "Basking in related glory"
    },
    {
      "term": "Quiz type: radio, What is true about creating fandom? | It is normally achieved from one game/match | There needs to be history, tradition and authenticity, as well as entertainment value | In order to get fans, a team has to win a championship | Sports teams must have highly paid sports stars for people to be a fan of their team | Fandom is only created on a global scale",
      "definition": "There needs to be history, tradition and authenticity, as well as entertainment value"
    },
    {
      "term": "Quiz type: radio, Awareness in sports sponsorship increases when____? | Competitors also sponsor | Brand awareness is well maintained  | Brand is originally unfamiliar and unknown | Communicated through one channel only | All of the above",
      "definition": "Brand awareness is well maintained"
    },
    {
      "term": "Quiz type: radio, What are some aspects of cross country sports marketing? | It is limited because sports are not international by nature | Growth is only globalized | Growth can be as a product or medium  | Market selection is a minor process in the success rate of cross country sports  | Growth is only localized",
      "definition": "Growth can be as a product or medium"
    },
    {
      "term": "Quiz type: radio, What is a characteristic of cross industry sports marketing? | Sports can be a source or a destination of innovation  | Sports exporting is how to add to experience at spectator or participation level | Sports importing is how to distill the essence of sports to your industry | Sports is only a source of innovation | All of the above",
      "definition": "Sports can be a source or a destination of innovation"
    },
    {
      "term": "Quiz type: radio, What is an example of sports importing? | Virtual and Augmented Reality | Team Play | Fair Play | Organized Competition | All of the above",
      "definition": "Virtual and Augmented Reality"
    },
    {
      "term": "Quiz type: radio, In Entertainment Marketing, Netflix matched Noon Nopi of ___________ and Steve Jobs matched Noon Nopi of ____________. | attention seeking, binge viewing | preference for the postal service, computer games | binge drinking, low prices | comic books, computer customization | binge viewing, attention holding     ",
      "definition": "binge viewing, attention holding"
    },
    {
      "term": "Quiz type: radio, Which of the following is FALSE? | there can be many sources for big ideas | Big Idea Sourcing is when a company is not from a country like the United States, and so much use good ideas | A source of big ideas is not from the company's history      | nostalgia can be a source for big ideas | packaging can be a source for big ideas even if the packaging isn’t very good",
      "definition": "A source of big ideas is not from the company's history     "
    },
    {
      "term": "Quiz type: radio, Which of the following is NOT an advantage of placement? | Exposure and frequency | Support for other media | Association/Image transfer | Higher defense against attention to a brand | Bypass regulation",
      "definition": "Higher defense against attention to a brand"
    },
    {
      "term": "Quiz type: radio, In Cross Country Entertainment market configuration it is important ____________. | to keep in mind that some products will have a broader appeal in some countries and a narrower appeal in others      | to keep in mind that entertainment products have universal appeal and so it should not matter which country you are in | to keep in mind that movies are the only entertainment products that have broader appeals in all countries | to keep in mind that movies are the best entertainment products to enter emerging markets | to keep in mind that entertainment products will have a narrower appeal in emerging markets",
      "definition": "to keep in mind that some products will have a broader appeal in some countries and a narrower appeal in others"
    },
    {
      "term": "Quiz type: radio, Which of the following is an example of Entertainment Exporting? | Sourcing and adaptation of content | Bundling content across media | Second life market for new products | Franchise/continuity building for companies | All of the above     ",
      "definition": "All of the above"
    },
    {
      "term": "Quiz type: radio, Any business can technically be like Show Business as long as it is ____________. | entertaining, disengaging, boundary-breaking, and value innovating | entertaining, engaging, boundary-setting, and value creating | entertaining, engaging, boundary-setting, and value co-creating | entertaining, engagaing, boundary-breaking, and value co-creating      | entertaining, disengaging, boundary-breaking, and value co-creating",
      "definition": "entertaining, engagaing, boundary-breaking, and value co-creating"
    },
    {
      "term": "Quiz type: radio, Which of the following is a Marketing implication of OTT TV? | Cable companies are becoming more powerful | Segmentation, targeting and positioning must focus on Millennials watching TV online      | Consumers are losing power | Multi-platform content delivery strategy is no longer relevant | Cannibalization is not a problem because of synergy",
      "definition": "Segmentation, targeting and positioning must focus on Millennials watching TV online"
    },
    {
      "term": "Quiz type: radio, Making brands ownable means ____________. | to allow consumers to easily adopt the brand | to allow consumers to easily re-stylize the brand | to allow consumers to easily spread the brand | All of the above      | None of the above",
      "definition": "All of the above"
    },
    {
      "term": "Quiz type: radio, In cross country entertainment, it is important to remember that ___________. | entertainment is not a universal need by nature so must be approached carefully | entertainment is not a medium in international marketing | entertainment cannot be globalized | entertainment cannot be localized | the landing market is important     ",
      "definition": "the landing market is important     "
    },
    {
      "term": "Quiz type: radio, Which of the following is NOT an example of Entertainment Importing? | Experience reduction      | Content delivery | Content curation | Customer journey | Global expansion",
      "definition": "Experience reduction"
    }
  ]
}
