{
  "quizSrc": [
    {
      "term": "Quiz type: radio, Read this scenario before attempting the question. Leonardo works at nonprofit science education organization called Kid-periment, which helps elementary schools in low income neighborhoods develop strong science programs. Kid-periment helps teachers develop lesson plans and provides them with teaching and lab materials for some exciting experiments. Leonardo requested that a grant agency give $10,000 to Kid-periment. The grant agency's board invited him in to deliver a talk in support of his application. Leonardo delivered the 5-minute presentation he gives to schools to get them excited about partnering with Kid-periment. The board denied him the funds. A week later, he asks one of the board members why they didn’t give him the money. His organization is doing great things. The board member replies, “We didn’t hear how Kid-periment aligns with our donation strategy. It was a fun talk and you showed us some neat experiments, but it didn’t feel like a serious presentation for a substantial amount of money.” If we were analyzing this case with the rhetorical canons, what would we say misfired in Leonardo’s presentation?  | Memory and Delivery   | Arrangement and Style | Invention and Style | Memory and Invention ",
      "definition": "Invention and Style"
    },
    {
      "term": "Quiz type: radio,  In public speaking, invention refers to: | coming up with ideas for a speech. | designing the props for a speech. | designing a mnemonic device for remembering the speech. | creating the speech’s organization.",
      "definition": "coming up with ideas for a speech."
    },
    {
      "term": "Quiz type: radio, Writing is ________, but language is ________. | designed; spontaneous | learned; acquired | spontaneous; designed | acquired; learned",
      "definition": "learned; acquired"
    },
    {
      "term": "Quiz type: radio, Let’s say that you and your friend are talking about a movie currently playing in theaters. He asks you how you liked the movie. You could say, “the ending was lousy” (implying most other parts were pretty good) or “the ending waaass LOOUUSSSYYY!!!” (it was really not a good ending and you have somewhat strong feelings about this). The two responses have different meanings because of:  | lexical content. | prosody. | syntax.",
      "definition": "prosody."
    },
    {
      "term": "Quiz type: radio, We typically want to avoid speaking in a monotone voice. Why?  | Monotone voices are boring.  | Monotone voices suffer from the problem of bad arrangement. When the ideas are not organized appropriately, the voice tends to flatten out.  | Monotone voices don’t provide the prosodic cues that vibrant ones do. | Monotone voices reveal a lack of enthusiasm on the part of the speaker. ",
      "definition": "Monotone voices don’t provide the prosodic cues that vibrant ones do."
    },
    {
      "term": "Quiz type: radio, At the broadest level, this course will focus on: | designing clear presentations and delivering them in an engaging way. | honing in on\na single successful genre of public speaking that encompasses all specific\ntypes of presentations. | correcting problems of accent in spoken English.  | identifying delivery problems and proposing appropriate solutions. ",
      "definition": "designing clear presentations and delivering them in an engaging way."
    },
    {
      "term": "Quiz type: radio, We will study public speaking as an art, which means balancing: | instruction, imitation, and practice.  | modeling, delivery, and reflecting. | application,\ndelivery, and communication. | input, performance,\nand output. ",
      "definition": "instruction, imitation, and practice."
    },
    {
      "term": "Quiz type: radio, Based on the lecture, the five main parts of a study of public speaking include: |   arrangement, invention, style, gestures, movement.   | invention, arrangement, style, memory, delivery. | style,\ninvention, arrangement, delivery, audience. | gestures, movement, vocalization, articulation, projection. ",
      "definition": "invention, arrangement, style, memory, delivery"
    },
    {
      "term": "Quiz type: radio, Based on the readings and the lectures, a claim is: | a statement that you want the audience to accept as valid.  | the most important piece of evidence in the argument. | the logical connection that your audience must make in order to understand your argument. | the assertion you don’t have support for.",
      "definition": "a statement that you want the audience to accept as valid."
    },
    {
      "term": "Quiz type: radio, Read this short argument from a person arguing for city action at a council meeting: \"We should build a separate bike lane on 15th Ave because the current road is dangerous to bicyclists. Currently, bicyclists like myself can’t get to work on time. I end up having to rush and might lose my job due to chronic tardiness.\" There are lots of problems with this from an argument standpoint. Select the most pressing problem. | The speaker doesn’t present statistics in support of their claim. | The arrangement is confusing. | The phrasing is too wordy. | The support doesn’t relate to the claim.",
      "definition": "The support doesn’t relate to the claim."
    },
    {
      "term": "Quiz type: radio, Based on the lectures, select the most appropriately arranged speech. | Topic: The history of Seattle\n\nI. The Duwamish tribe in the 1700s\n\nII. The first permanent European settlement in 1852\n\nIII. The great fire of 1889\n\nIV. The bust era of the 1970s\n\nV. Seattle in 2016 | Topic: The history of Seattle\n\nI. Early Seattle before European settlers\n\nII. The founding of Seattle and early growth (1852-1914)\n\nIII. Seattle as a stable timber and aerospace town (1917-1980)\n\nIV. The tech industry kicks off another growth spurt (1990-today) | Topic: The history of Seattle\n\nI. Early Seattle until the first European settlers (1600-1852)\n\nII. Key events in pre-war Seattle (1852-1914)\n\nIII. The inter-war years (1917-1941)\n\nIV. Seattle goes to war (1942-1945)\n\nIV. The values of a modern port city\n\nVI. The role of religion in Seattle",
      "definition": "Topic: The history of Seattle\n\nI. Early Seattle before European settlers\n\nII. The founding of Seattle and early growth (1852-1914)\n\nIII. Seattle as a stable timber and aerospace town (1917-1980)\n\nIV. The tech industry kicks off another growth spurt (1990-today)"
    },
    {
      "term": "Quiz type: radio, Look at this basic argument. Topic: Online education will never replace traditional universities. I. Only traditional universities offer student services like mentoring, certification, and social networking II. Online education doesn’t allow students to get to know their professors Based on the lectures, the biggest problem with the main points below would be that the two points: | don't feel balanced with one another (a coordination problem). | don't both work to advance the topic. (a subordination problem).  | cover the same topics and thus overlap too much (a discreteness problem).",
      "definition": "don't both work to advance the topic. (a subordination problem). "
    },
    {
      "term": "Quiz type: radio, An appeal to ________ attempts to persuade audiences based on the credibility of the speaker. | pathos | ethos | logos ",
      "definition": "ethos"
    },
    {
      "term": "Quiz type: radio, If you don't know the answer to a question, how acceptable is to say \"I don't know\"? | completely unacceptable; it hurts more to admit ignorance than to dodge the question.  | preferable; you might actually tell them you don’t know when you actually do.  | acceptable; admitting your limitations here can enhance your ethos.  |  largely unacceptable; it costs a huge amount of ethos.",
      "definition": "acceptable; admitting your limitations here can enhance your ethos."
    },
    {
      "term": "Quiz type: radio, Let's say you're doing a 5-7 minute key point speech on the how students can succeed in college and you come up with this basic outline: Topic: Keys to college success. I. Focus on learning more than majors. II. Plan out a rigorous curriculum. III. Develop relationships with faculty. For point III, you develop the following support: III. Develop relationships with faculty. A. go to professors' office hours B. take advantage of research opportunities. Which discussion of point III would be best? | Students do best when\nthey develop relationships with faculty. I don’t mean superficial first name\nbasis type of relationships. I mean relationships where you understand the\nfaculty’s research and the faculty understands your intellectual goals. There\nare a couple ways that you can do this. One is to simply go into office hours.\nDuring office hours, students can have more elaborate conversations about their\ngoals. Students can also begin to understand professors’ work and habits of\nmind. This type of one-on-one contact is important in any type of relationship,\nand certainly a professional student/teacher relationship. Also, students can\ndevelop relationships by working with faculty members on research projects. When\nmy wife was in college, she had the opportunity to serve as an editorial\nassistant for a professor working on a Linguistics dictionary. She eventually\npursued a career in Linguistics. Because he knew her well, the professor was\nable to write her a strong letter of recommendation. Developing good\nrelationship professors often that starts with either going into their office\nhours or offering to help on a research project.  | Students do best when the develop relationships with\nfaculty. This can be as simply as going to office hours or taking advantage of\nresearch opportunities. Developing good relationship professors often that\nstarts with either going into their office hours or offering to help on a\nresearch project. | Students do best when they develop relationships with\nfaculty. I don’t mean superficial first name basis type of relationships. I\nmean relationships where you understand the faculty’s research and the faculty\nunderstands your intellectual goals. There are a couple ways that you can do\nthis. One is to simply go into office hours. During office hours, students can\nuse the time to ask questions about the material. As a student, I often went\ninto my professor’s office hours before a test and the feedback was very\nhelpful. I wouldn’t say I had much a relationship with the professor (it was an\nastronomy class), but I was able to do better on each and every assignment as a\nresult.  Also, students can develop relationships\nby working with faculty members on research projects. When I was in college, I\nended up working at the television station. While I didn’t pursue television,\nit kept me interested in professional development and performance, which\nultimately shaped my decision to go to graduate school. Developing good\nrelationship professors often that starts with either going into their office\nhours or offering to help on a research project. ",
      "definition": "Students do best when they develop relationships with\nfaculty. I don’t mean superficial first name basis type of relationships. I\nmean relationships where you understand the faculty’s research and the faculty\nunderstands your intellectual goals. There are a couple ways that you can do\nthis. One is to simply go into office hours. During office hours, students can\nuse the time to ask questions about the material. As a student, I often went\ninto my professor’s office hours before a test and the feedback was very\nhelpful. I wouldn’t say I had much a relationship with the professor (it was an\nastronomy class), but I was able to do better on each and every assignment as a\nresult.  Also, students can develop relationships\nby working with faculty members on research projects. When I was in college, I\nended up working at the television station. While I didn’t pursue television,\nit kept me interested in professional development and performance, which\nultimately shaped my decision to go to graduate school. Developing good\nrelationship professors often that starts with either going into their office\nhours or offering to help on a research project. "
    },
    {
      "term": "Quiz type: radio, Which of the examples below would be the best option to use for support item B? Thesis: Plagiarism at universities should be dealt with more harshly. I. Plagiarism can undermine a University's reputation A. Talk about how the Air Force Academy boosted its reputation by instituting a zero tolerance policy on cheating and plagiarism B. | Talk about the policy on cheating and plagiarism at Indiana University. | Give a hypothetical example about a friend who plagiarized a paper. | Talk about how the cheating and plagiarism scandal at the University of Virginia hurt its reputation. | Talk about the time that a teacher friend of mine caught a plagiarized paper by a student.",
      "definition": "Talk about how the cheating and plagiarism scandal at the University of Virginia hurt its reputation."
    },
    {
      "term": "Quiz type: radio, Let's say you're doing a key point speech on the benefits of MOOCs and you come up with this basic outline: Topic: A public speaking MOOC helps you develop skills. I. It can help you grow personally. II. It can help you excel academically. III. It can help you advance professionally. Which version of point III would you NOT want to use? | III. It can help you advance professionally. \n\nA. example of how it helped you on the job \n\nB. example of how it helped you at your Star Trek fan club | III. It can help you advance professionally. \n\nA. you can engage in better internal communication \n\nB. you can engage in better external communication | III. It can help you advance professionally. \n\nA. you can perform better presentations\n\nB. you can write better reports",
      "definition": "III. It can help you advance professionally. \n\nA. example of how it helped you on the job \n\nB. example of how it helped you at your Star Trek fan club"
    },
    {
      "term": "Quiz type: radio, At a minimum, your transitions should: | provide the audience a chance to ask a question. | include physical movement. | highlight where you are in the speech. | break up the sound of the presentation.",
      "definition": "highlight where you are in the speech."
    },
    {
      "term": "Quiz type: radio, Let's say you're doing a 5-7 minute key point speech on the benefits of a public speaking MOOC. You come up with this basic outline: Topic: A public speaking MOOC help you develop skills. I. It can help you grow personally. II. It can help you excel academically. III. It can help you advance professionally. Based on the lectures, which is probably the best conclusion? | Personally, professionally, and academically. All the ways that a MOOC can help you. Close your eyes. Envision yourself with the skills of a strong public speaker. That can be yours. Or not. | Given my experiences, I think a public speaking MOOC can help you develop an impressive set of skills. It can help you personally, academically, and professionally. I recently finished my first speech MOOC experience and I plan on doing the whole course again very soon.  | I think a public speaking MOOC can help you develop skills. As we discussed, it can, first, help you grow personally. Then I talked about how it can, second, help you academically. And I concluded my speech with a third point about how it can help you with profession development. I recently finished my first speech MOOC experience and I plan on doing the whole course again very soon. It has been a valuable experience that I look forward to repeating.",
      "definition": "Given my experiences, I think a public speaking MOOC can help you develop an impressive set of skills. It can help you personally, academically, and professionally. I recently finished my first speech MOOC experience and I plan on doing the whole course again very soon."
    },
    {
      "term": "Quiz type: radio, Let's say you're doing a key point speech on the benefits of MOOCs for lifelong learners (that is, people who routinely try to improve knowledge areas and skill; professional development). Topic: MOOCs are better than universities for lifelong learners I. MOOCs offer more courses that are appropriate to lifelong learners. II. MOOCs better respond to the learning needs of lifelong learners. Read the discussion of point II below and then select the option that best represents the content. MOOCs better respond to the learning needs of lifelong learners. I mean their needs as professional working adults. Why is this? Universities operate on an established timeline with set content. MOOCs don't. MOOCs have flexible timelines and content. And this flexibility is exactly what lifelong learners need most. Traditional academic courses are dominated by their calendars. It could be 10 weeks or 15 weeks, but the course has to begin and complete at the same time. All students, regardless of experience or prior exposure are expected to master the same content at the same rate. I had this experience back in college. I took an Astronomy course. I liked it, but I wasn't good at the math. I went in regularly to get help. I spent an inordinate amount of time working on the course, but my progress was simply too slow. I ended up dropping that course. Why? Same reason many students drop courses. The Midterm. I could grasp the material, but the class was moving too fast for me. The professor didn't have a choice. He had to determine how quickly an \"average\" student in his class could grasp the material and build the syllabus to fit 15 weeks. I was below that average; others, no doubt, were above it. Didn't matter. The calendar ruled us all. It's not their fault, but it is inflexible. Contrast this to a MOOC. A MOOC is almost entirely self-paced. Students work on a MOOC when they have the time and move on only when they grasp something. This is sometimes called mastery learning. Learners advance to the next stage when they have mastered the current stage. My son goes up for karate belts in the same way. I took a nutrition MOOC a couple of years ago. I was able to move through the material I already knew very quickly (taking quizzes along the way). I sped through the first weeks of material in a few nights. Then I spent weeks on the next few lessons because they were challenging and I was busy. In a traditional class, I would have had to sit through weeks of material I already knew. Lifelong learners need the flexibility at the core of MOOCs. The vast majority of MOOC learners already have bachelor's degrees and lots of work experience. Demanding that they sit in a lecture hall with 200 other students at 200 different levels doesn't work for them. MOOCs work better for lifelong learners because they better respond to their learning needs. | II. MOOCs are more flexible \n\nA. Universities aren’t flexible \n\nB. MOOCs are flexible \n\nC. Lifelong learners need flexibility | II. MOOCs better respond to the flexible learning needs of lifelong learners.\n\nA. University learning requires set content and timing\n\nB. MOOCs allow for self-paced learning\n\nC. Lifelong learners need these self-paced learning options | II. MOOCs are better for learners.\n\nA. Universities don’t understand the needs of professional students\n\nB. MOOCs do understand the needs of professional students\n\nC. Professional students should take MOOCs",
      "definition": "II. MOOCs better respond to the flexible learning needs of lifelong learners.\n\nA. University learning requires set content and timing\n\nB. MOOCs allow for self-paced learning\n\nC. Lifelong learners need these self-paced learning options "
    },
    {
      "term": "Quiz type: radio, Read the options below and pick the one with the best pause\nbreaks. (.) = short pause (under a second) (1) or (1.5)=timed pause (1 or 1.5 seconds) | The biggest challenge\nwith pauses (.) especially when discussing more complex ideas (.) is finding\nthe right place to locate them (1) it certainly is easier when dealing with\npunctuation(.) because we’ve been trained(.) to “see” (.)punctuation (1.5) and\nwe have a couple of standard(.) if not commonly understood(.)rules | The biggest challenge with pauses (.) especially when\ndiscussing more complex ideas is finding the (.) right place to (.) locate (.)\nthem (.) it certainly is easier when dealing with punctuation because (.) we’ve\n(.)been trained(.) to “see” (.) punctuation and we have a couple of standard (2)\nif not commonly understood (.) rules | The biggest challenge with pauses especially when discussing\nmore complex ideas (.) is finding the right place to locate them (.) it\ncertainly is easier when dealing with punctuation because we’ve been trained to\n“see” punctuation (.) and we have a couple of standard if not commonly\nunderstood rules",
      "definition": "The biggest challenge\nwith pauses (.) especially when discussing more complex ideas (.) is finding\nthe right place to locate them (1) it certainly is easier when dealing with\npunctuation(.) because we’ve been trained(.) to “see” (.)punctuation (1.5) and\nwe have a couple of standard(.) if not commonly understood(.)rules"
    },
    {
      "term": "Quiz type: radio, Jurgen is a mechanical engineer. He has always been a bit shy. He has lots of close friends but tends not to be too outgoing in new social settings. To make matters worse, he had a really bad public speaking experience in the past year. He was a designer on some custom glass cutting equipment for a local production facility. He was demonstrating the new equipment for customer, walking them through the process, when he forgot everything he was going to say. He became very flustered and the audience became noticeably annoyed. He has to deliver another product demonstration in two weeks and is feeling a huge amount of apprehension. Chun is also a mechanical engineer. Unlike Jurgen, she is pretty outgoing and tends to speak up in social situations. She doesn’t necessarily love public speaking, but she doesn't dread it either. She also worked on the new glass cutting equipment. She was asked to deliver a short demonstration to another production facility that might be interested in contracting work with her company. Two days before the presentation, her supervisor confided to her that this new contract is very important to the overall financial well-being of the company. They really need this new contract. On the day of the presentation, it becomes clear that one of the potential customers is antagonistic. During the presentation, he keeps peppering Chun with sarcastic questions about the equipment and snide statements like, “how can this possibly cost what you’re charging?” Chun is getting very apprehensive as she continues. Which of the following best describes Jurgen and Chun’s apprehension? | Jurgen has high trait speech apprehension. Chun has low trait apprehension, but is experiencing high state apprehension.  | Jurgen has high state speech apprehension. Chun has low state apprehension, but is experiencing trait state apprehension.  | Jurgen has low state speech apprehension. Chun has high trait apprehension, and is experiencing high state apprehension.  | Jurgen has high trait speech apprehension. Chun has low state apprehension, but is experiencing high trait apprehension.  | Jurgen has high state speech apprehension. Chun has high trait apprehension, but is experiencing low state apprehension. ",
      "definition": "Jurgen has high trait speech apprehension. Chun has low trait apprehension, but is experiencing high state apprehension."
    },
    {
      "term": "Quiz type: radio, We talked about systematic sensitization as a treatment for public speaking apprehension. Here is an example of how you might use this technique. Find a comfortable chair and start with some relaxation techniques. Breathe slowly and think about each part of your body relaxing, moving slowly from your legs to your head. Once thoroughly relaxed (but not asleep), imagine a public speaking encounter. To begin with, imagine a relaxed speaking encounter. Let’s say you picture telling a story to a group of friends. The more detailed you can make this visualization, the better. Next, imagine a slightly more stressful speech. Let’s say you picture yourself explaining your last work project to a small handful of colleagues in a relaxed office setting. Still relaxed? If not, recognize that and relax your muscles again. Move on to a more stressful event, and so forth, increasing the formality, size, and prestige of the audience. Why is this supposed to work? | You are increasing the stimulus while maintaining a relaxed state.  | You are calmer.  | You are visualizing yourself doing well.",
      "definition": "You are increasing the stimulus while maintaining a relaxed state."
    },
    {
      "term": "Quiz type: radio, For fluency, which is more important? Articulation Rate (how fast you say individual words) or Speech Rate (how many words you say in a span of time)?  | Speech Rate | Articulation Rate",
      "definition": "Speech Rate"
    },
    {
      "term": "Quiz type: checkbox, Which of the following are situational factors that can make certain speeches more apprehensive inducing than others?  | Formality | Status  | Degree of evaluation | Novelty",
      "definition": "Formality | Status | Degree of evaluation | Novelty"
    },
    {
      "term": "Quiz type: radio, The main resonating areas are the: | nasal cavity, vocal folds, and pharynx. | pharynx, larynx, and vocal folds.  | nasal cavity, oral cavity, and pharynx | vocal folds, oral cavity, and larynx.",
      "definition": "nasal cavity, oral cavity, and pharynx"
    },
    {
      "term": "Quiz type: radio, Prestige dialects are typically _____________. | associated with higher wealth and class | more correct than non-prestige variants  | static and unchanging | outdated and rarely used in most societies",
      "definition": "associated with higher wealth and class"
    },
    {
      "term": "Quiz type: radio, Uptalk can function as an \"engagement marker.\" What does this mean? | Uptalk shows that the speaker is interested in the topic because their tone is higher. | Uptalk can invite listeners to agree or interact with a declarative statement. | Since rising intonation always indicates a question in English, uptalk encourages lots and lots of engaging questions. ",
      "definition": "Uptalk can invite listeners to agree or interact with a declarative statement."
    },
    {
      "term": "Quiz type: radio, In most US workplaces, women are interrupted more times than their male colleagues. | False | True",
      "definition": "True"
    },
    {
      "term": "Quiz type: checkbox, What are some questions you should ask at the start of your speech planning?  | What’s your value?    | What’s the context for your talk? | Should I start with a joke? | How will I start the speech? | Who\nis the audience? | What do they know? | What will I wear? | Will I use slides?",
      "definition": "What’s your value? | What’s the context for your talk? | Who\nis the audience? | What do they know?"
    },
    {
      "term": "Quiz type: radio, You should approach speech composition as a linear process. Research the talk, write it, practice it, and\nthen deliver it for an audience.  | False | True",
      "definition": "False"
    },
    {
      "term": "Quiz type: radio, Look at these flawed speech goals. In my informative speech on the neighborhoods of Seattle, I want to: explain how these neighborhoods formed. mention some of the distinct characteristics of each neighborhood. discuss the history of Seattle's logging history and its impact on neighborhood development. The biggest problem with these goals, as discussed in class, is that they DON'T address ________ outcomes. | audience | complex | speaker | topic",
      "definition": "audience"
    },
    {
      "term": "Quiz type: checkbox, Junko is a librarian. She needs to work up a 5-minute talk to give at retirement homes about some of the new services the library offers. She's done this talk a couple of times in the past and never felt like the presentation went great. Since many at this particular retirement home can't drive to the local branch, she wants to play up the online material. Users have actually really liked the library's web portal for lots of community services. Historically, this audience hasn't been enthusiastic about the online material, though almost all of them are library card holders. However, Junko has trained some at this retirement home to effectively navigate the webpage and they've loved it and become regular users. Junko wants to really equip this audience to do more with the library's webpage. Which three choices below would be good primary speech objectives for Junko? | Be excited about the library’s online services | List the differences between the online search feature and the old card catalogue system. | Be able to check a book out online | Be able to navigate the “community activities” page | Distinguish between online reserves (which are free to library card holders) and free online reading materials (which are free to anyone with or without a library card). | Explain why rotating collections (few books spread out over many small libraries) is a better system than large stable collections (many books housed in a single location).",
      "definition": "Be excited about the library’s online services | Be able to check a book out online | Be able to navigate the “community activities” page"
    },
    {
      "term": "Quiz type: radio, Your practice versions of a speech should probably be ___________ than the time allowed for the speech itself.  | Shorter | Longer",
      "definition": "Shorter"
    },
    {
      "term": "Quiz type: radio, Jorge has created a new system for classifying clients for his marketing firm. Rather than the old system of “first come, first served,” his new system includes a number of metrics for matching the client to the right department and consultant. This is just a short series of questions and categories to quickly get the client to the right place. It’s innovative, but pretty straightforward. The system has worked well and now the rest of the office needs to implement it. The rest of the office has heard about his system and is excited about it, given the well-known problems of the old system. Yet, most don’t know exactly how the new system works. Jorge has 10 minutes to talk about the system at the next all-office meeting. Given this background, how should he spend his time? | Train people on using the new classification system.  | Discuss the impacts of the new classification system.  | Talk about the need for the new classification system. ",
      "definition": "Train people on using the new classification system."
    },
    {
      "term": "Quiz type: checkbox, What were the three main types of speech goals we discussed? | Attitude | Content | Ability | Interest | Likeability | Belief | Ethos | Skill",
      "definition": "Attitude | Content"
    },
    {
      "term": "Quiz type: radio, Based on our discussion of writing speech goals, which of the following goals are best? | In my presentation on the history of distance learning, I want audience members to:\n\nUnderstand the how mail order classes affected American higher education\n\nExamine their own beliefs about distance learning\n\nTalk through the benefits and limitations of MOOC learning | In my presentation on the history of distance learning, I want audience members to:\n\nExplain how mail order classes impacted the American textbook industry\n\nList the ways in which evening classes altered the mission of public universities\n\nDistinguish MOOC providers according to their mission | In my presentation on the history of distance learning, I want audience members to:\n\nDescribe the ways distance learning influenced American higher education\n\nFeel like they know how to sign-up for an online course\n\nSense the changing nature of education",
      "definition": "In my presentation on the history of distance learning, I want audience members to:\n\nExplain how mail order classes impacted the American textbook industry\n\nList the ways in which evening classes altered the mission of public universities\n\nDistinguish MOOC providers according to their mission"
    },
    {
      "term": "Quiz type: radio, Look at these flawed, speech goals. In my informative speech on the neighborhoods of Seattle, I want to: explain how these neighborhoods formed. mention some of the distinct characteristics of each neighborhood. discuss the history of Seattle’s logging history and its impact on neighborhood development. The biggest problem with these goals, as discussed in class, is that they DON’T address ________ outcomes.  | speaker  | topic  | complex | audience",
      "definition": "audience"
    },
    {
      "term": "Quiz type: checkbox, What do we want to make sure to do in our conclusions? | Review the key ideas. | Restate that key issue. | End with a clear conclusion.    | Say \"thank you.\" | review all the sub-points.",
      "definition": "Review the key ideas. | Restate that key issue. | End with a clear conclusion."
    },
    {
      "term": "Quiz type: radio, For informative speaking, we typically want to identify the topic clearly and early in the talk.  | Yes, it provides context.  | No, it ruins the mystery. ",
      "definition": "Yes, it provides context."
    },
    {
      "term": "Quiz type: radio, The New York Times reported that fewer than 10% of students who enroll in a MOOC end up completing it. What type of evidence is this? | Metaphor | Statistic | Example     | Testimony",
      "definition": "Statistic"
    },
    {
      "term": "Quiz type: radio, Idris is doing a talk on the recent changes in online learning. In a main point about “Changes to online course providers” he has the subpoint, “MOOCs are being more modular.” In support of this subpoint, he’s pulling from a recent research article. The article and its abstract are below. Kizilcec, R., & Schneider, E. (2015). Motivation as a Lens to Understand Online Learners: Toward Data-Driven Design with the OLEI Scale. ACM Transactions on Computer-Human Interaction (TOCHI), 22(2), 1-24. Abstract: Open online learning environments attract an audience with diverse motivations who interact with structured courses in several ways. To systematically describe the motivations of these learners, we developed the Online Learning Enrollment Intentions (OLEI) scale, a 13-item questionnaire derived from open-ended responses to capture learners’ authentic perspectives. Although motivations varied across courses, we found that each motivation predicted key behavioral outcomes for learners (N = 71, 475 across 14 courses). From learners’ motivational and behavioral patterns, we infer a variety of needs that they seek to gratify by engaging with the courses, such as meeting new people and learning English. To meet these needs, we propose multiple design directions, including virtual social spaces outside any particular course, improved support for local groups of learners, and modularization to promote accessibility and organization of course content. Motivations thus provide a lens for understanding online learners and designing online courses to better support their needs. Which of the following best summarizes this article for the sub-point “MOOCs are being more modular”? | MOOCs are being more modular. More modular control results in more learner satisfaction. Rene Kizilcec and Emily Schneider, researchers at Stanford university conducted a study of over 70 thousand learners in 14 different online courses. What did they find? Motivation predicted behavior. “From learners’ motivational and behavioral patterns, we infer a variety of needs that they seek to gratify by engaging with the courses, such as meeting new people and learning English.” They make multiple design recommendations for online courses, including creating more virtual spaces. So, breaking up the places where people can interact inside an online course better reflects people’s differing motivations. They also recommended increased online support for groups of learner who join a course together. So, a club or a business might sign up for a course at the same time and progress through the course together. Online courses can support this by allowing group members to identify themselves and speak more easily with other group members in the course. They also called for increased modularization to allow for different types of content organization. So, instead of having one pathway through the material: lesson 1, followed by lesson 2, and so forth. They suggested allowed for multiple pathways. Since users are coming to online classes with multiple motivations, MOOCs need to become more modular.  | MOOCs are being more modular. Researchers from Stanford looked at over 70 thousand learners in 14 different online courses. What did they find? Motivation predicted behavior. The study concluded that online courses should allow for different motivations. Make classes more modular. The researchers recommended breaking up courses to allow different users to use them differently based on their motivations. Learners should be able to organize the lectures chronologically or topically, based on their needs. Demands for modular control drives MOOCs to become more modular.  | MOOCs are being more modular. That is, they are moving away from a single standard way of organizing the course. Not simply one pathway from beginning to end. Rather, the class is broken up into separate modules that learners can choose to interact with in a different order. It turns out that learners are often pretty good at knowing how to use a class for their needs. Researchers from Stanford looked at over 70 thousand learners in 14 different online courses. What did they find? Motivation predicted behavior. If you joined a course to meet new people, odds are you posted more in the discussion forums. If you wanted to earn a certificate, you completed more videos and assignments. They concluded that online courses should allow for different motivations. Making classes more modular is one way to do this. The researchers recommended, for example, breaking up courses to allow different users to use them differently based on their motivations. So, instead of having one pathway through the material: lesson 1, followed by lesson 2, and so forth. They suggested allowing for multiple pathways. A beginner may be motivated to learn the material in sequential order. An advanced learner might just want the course as a reference guide. Learners should be able to organize the lectures chronologically or topically, based on their needs. Demands for modular control drives MOOCs to become more modular. ",
      "definition": "MOOCs are being more modular. That is, they are moving away from a single standard way of organizing the course. Not simply one pathway from beginning to end. Rather, the class is broken up into separate modules that learners can choose to interact with in a different order. It turns out that learners are often pretty good at knowing how to use a class for their needs. Researchers from Stanford looked at over 70 thousand learners in 14 different online courses. What did they find? Motivation predicted behavior. If you joined a course to meet new people, odds are you posted more in the discussion forums. If you wanted to earn a certificate, you completed more videos and assignments. They concluded that online courses should allow for different motivations. Making classes more modular is one way to do this. The researchers recommended, for example, breaking up courses to allow different users to use them differently based on their motivations. So, instead of having one pathway through the material: lesson 1, followed by lesson 2, and so forth. They suggested allowing for multiple pathways. A beginner may be motivated to learn the material in sequential order. An advanced learner might just want the course as a reference guide. Learners should be able to organize the lectures chronologically or topically, based on their needs. Demands for modular control drives MOOCs to become more modular."
    },
    {
      "term": "Quiz type: radio, Alexander is an admissions officer at university on the quarter system and regularly presents to prospective students (and their parents) about the differences between the US quarter and semester systems. While roughly 60% of US schools use the semester system (15 week classes), about 20% use the quarter system (10 week classes). Many of the audiences Alexander addresses are familiar with the semester system; less so with the quarter system. In his usual talk, he discusses the differences in how many classes students take in the two systems, how the days are structured differently, and how the credits are different. He has an entire subpoint devoted to explaining how despite all their differences, the amount of time spent on instruction per class is roughly the same. Which of the following discussions is best for clarifying this?  | Quarters and semesters actually have about the same class meeting times. That might sound surprising. It was to me when I first started in a quarter system. But it comes down to minutes. How many minutes you devote to each class and subject. In a semester system, you spend 75 minutes in a class that meets twice a week or 50 minutes in a class that meets three times a week. Multiplied across the 15 weeks in the semester system, brings you to 2,250 total minutes, or about 37 and a half hours. In a quarter system, you spend 110 minutes in a class that meets twice a week or 50 minutes in a class that meets M-F. Multiplied across the 10 weeks in quarter system, brings you to 2,200 total class minutes, or about 36 and a half hours. The class times is the same in both the semester and quarter system. | Quarters and semesters end up being about the same amount of class time. Which is, to me, surprising. When I first came to this university, I had operated in a semester system for over 10 years. Initially, I couldn’t quite find my rhythm. They were pretty different, but eventually I made the conversion and have loved quarter since. I guess what had been so confusing was the fact that the class time was pretty similar. It varied a bit based on whether or not you met daily, but the class times were pretty close. Federal holidays would seem to throw that off, but it doesn’t. Certainly some quarters might have a couple of federal holidays, so you would not have class on those days. In a semester system though, you end up losing entire weeks to student breaks, like spring break. In a quarter system, the longest holiday that occurs within a quarter is probably Thanksgiving and that’s only two days. So, things like spring break simply become the breaks between the different quarters. So, though the class time might seem a bit different, they are actually pretty similar.  | Despite all those differences, the amount of time spent per class is roughly the same in quarter and semester systems. That is, you spend about the same number of hours learning introduction to statistics, for example, if you’re at Indiana University (semester system) or the University of Washington (quarter system). How can this be? Let’s say you’re at IU. You sign up for your stats course. It meets Tuesdays and Thursday for an hour and 15 minutes—75 minutes—each day. You do that for 15 weeks.  You end up with about 37 hours of classroom instruction. Semester system: 37 hours in a class. Now let’s say you’re at UW. You sign up for the same class. It also meets on Tuesdays and Thursdays, but each day it meets for over an hour and half—100 minutes—each day. You do that for 10 weeks and you end up with about 36 hours of classroom instruction. Quarter system: 36 hours in a class. One hour less than you would spend in the same class in a semester system. Both classes cover the same material. One does it in shorter classes for more weeks. One does it for longer classes in fewer weeks. The class times is the same in both the semester and quarter system.",
      "definition": "Despite all those differences, the amount of time spent per class is roughly the same in quarter and semester systems. That is, you spend about the same number of hours learning introduction to statistics, for example, if you’re at Indiana University (semester system) or the University of Washington (quarter system). How can this be? Let’s say you’re at IU. You sign up for your stats course. It meets Tuesdays and Thursday for an hour and 15 minutes—75 minutes—each day. You do that for 15 weeks.  You end up with about 37 hours of classroom instruction. Semester system: 37 hours in a class. Now let’s say you’re at UW. You sign up for the same class. It also meets on Tuesdays and Thursdays, but each day it meets for over an hour and half—100 minutes—each day. You do that for 10 weeks and you end up with about 36 hours of classroom instruction. Quarter system: 36 hours in a class. One hour less than you would spend in the same class in a semester system. Both classes cover the same material. One does it in shorter classes for more weeks. One does it for longer classes in fewer weeks. The class times is the same in both the semester and quarter system."
    },
    {
      "term": "Quiz type: radio, Anika is giving a 15-minute talk about her research on online learning to a conference audience. The conference deals with a number of education tech issues. So, her audience is generally knowledgeable about online learning, but not experts. She wants her audience to be able to explain her study. More importantly though, she wants audience members to know what recommendations to apply to make their online classes better. Which of the following outlines should she use? | outline 1 | outline 2 | outline 3 | outline 4",
      "definition": "outline 3"
    },
    {
      "term": "Quiz type: radio, Casey works as the chief financial officer for the Harrison Foundation, a non-profit that funds entrepreneurial opportunities and projects in Canadian low-income rural areas. She needs to give a financial review of the past four-months to the foundation’s board. In that time, they launched a new program; today is the first time anyone will be hearing the data. Casey’s basic outline touches on three key points. I. An update on the performance of the foundation’s investment portfolio II. An update on three existing foundation projects III. The first data on the foundation’s new direct-investment program Given this scenario, which introduction is best? | The Harrison Foundation’s mission statement is to identify exciting entrepreneurial opportunities to help low-income, rural Canadians improve their communities. We have been committed to this for 35 years and show no signs of stopping. I was drawn to Harrison Foundation because of its mission. For five years, I lived up in Iqaluit, which was about as isolated as you can get in the winter. Anyway, today we’ll talk about the financial health of the Harrison Foundation. As the chief financial officer, what our books look like keeps me up at night. We can’t do our work in aiding the health of rural Canada, if we don’t remain financially healthy. I think the best place to look is at how our investment portfolio has been doing the past few years.  | I want to thank the board for inviting me here today. From a financial standpoint, we’ve had a great couple of months. As you probably know, there was a fantastic article on the Harrison Foundation in Canadian Living last month. That coverage relates directly to what I want to talk about today. How our funding is directly leading to some interesting, high profile projects in Newfoundland and Labrador. In fact, our main project in Newfoundland also received an additional one million dollars in funding from the Bill and Melinda Gates Foundation. Harrison is having a good year. So, what I’d like to do today is start off by giving you a picture of how our investment portfolio is doing. Then, we’ll talk about three of our longstanding projects. I just want to give you an update on how they’re doing. Then finally, the new stuff. I want to talk about our new direct-investment program that partners directly with entrepreneurs, instead of going through other agencies. | Let’s get started. As you probably know, our portfolio last year had a strong showing. Which is particularly impressive because we haven’t been able to devote much staff to the issue. I think we got lucky in some regards. Also, since we deal in financial management on the mission side of our organization, many staff members here have some fiduciary background. That, by the way, is uncommon for most non-profits in, say, the arts. They tend to draw staff form that topic area and thus struggle more than we might when it comes to portfolio management. Anyway, let’s take a look at the numbers.",
      "definition": "I want to thank the board for inviting me here today. From a financial standpoint, we’ve had a great couple of months. As you probably know, there was a fantastic article on the Harrison Foundation in Canadian Living last month. That coverage relates directly to what I want to talk about today. How our funding is directly leading to some interesting, high profile projects in Newfoundland and Labrador. In fact, our main project in Newfoundland also received an additional one million dollars in funding from the Bill and Melinda Gates Foundation. Harrison is having a good year. So, what I’d like to do today is start off by giving you a picture of how our investment portfolio is doing. Then, we’ll talk about three of our longstanding projects. I just want to give you an update on how they’re doing. Then finally, the new stuff. I want to talk about our new direct-investment program that partners directly with entrepreneurs, instead of going through other agencies."
    },
    {
      "term": "Quiz type: radio, When thinking about slides, your first question should probably be: | Do I need slides?  | How many slides should I include?  | Will my slides mostly drive notetaking or simply be impact slides? | How will my presentation deck differ from my distribution deck?",
      "definition": "Do I need slides?"
    },
    {
      "term": "Quiz type: radio, when using a complex image like this | start at the top of the image and work down | start at the bottom of the image and work up.  | break it up over multiple slides",
      "definition": "break it up over multiple slides"
    },
    {
      "term": "Quiz type: radio, In an assertion-evidence slide, you___________. | Make a textual assertion and support it with visual evidence. | Make a textual assertion and support it with textual evidence. | Make a visual assertion and support it with textual evidence.  | Make a visual assertion and support it with visual evidence. ",
      "definition": "Make a textual assertion and support it with visual evidence."
    },
    {
      "term": "Quiz type: radio, Always test the mic before speaking by tapping on the top or blowing into it.  | False.  | True",
      "definition": "False. "
    },
    {
      "term": "Quiz type: radio, Always stay behind the podium. | True.  | False. ",
      "definition": "False. "
    },
    {
      "term": "Quiz type: radio, Ethos can be defined as the performance of the speaker’s:  | logic. | emotion. | humor. | credibility.",
      "definition": "credibility."
    },
    {
      "term": "Quiz type: radio, The main components of ethos are:  | a good hook, relevance, and orientation.  | knowledge, excellence, and goodwill. | logos, pathos, and mythos. | invention, arrangement, and style.",
      "definition": "knowledge, excellence, and goodwill."
    },
    {
      "term": "Quiz type: radio, Jonathan works for the public schools District 20. He needs to explain the idea of attendance zones for his audience. The audience is a general one. Many are parents with schoolchildren. Some have a background with the idea of attendance zones, but many don’t. Which of the following explanations of a concept is best according to our discussion of phronesis? | What are attendance zones? They are the areas that we use to determine which students go to which school. These zones change a bit over time as needed, but remain more or less the same across multiple years.  | District 20, like other districts, uses attendance zones. These are areas for determine which student goes where. For example, both Rampart and Air Academy high schools can each hold about 1,300 students. So, we need to draw boundaries so that students can go to a nearby school, without overloading one or the other. So, 2,000 at Air Academy, but only 800 at Rampart. These zones change a bit over time as needed. When one area of town has a spike in population. But these zones remain more or less the same across multiple years. | District 20 has flexible attendance zones that track closely to anticipated enrollment, which is derived from both our day 10 and day 200 surveys. Now, any changes made to specific sub-zones take a couple of years to fully obtain since there is a need for grandfathering in current students admitted under the previous growth boundary estimates. ",
      "definition": "What are attendance zones? They are the areas that we use to determine which students go to which school. These zones change a bit over time as needed, but remain more or less the same across multiple years."
    },
    {
      "term": "Quiz type: radio, Chinwe is speaking at conference. Most of the other speakers have stood at the podium and used the microphone. Chinwe is generally better when she moves away from the podium and interacts with the audience more. The room is fairly small and she knows that her audience could easily hear her. The conference is being recorded and the videos will be made available on the organization’s website. What should Chinwe do?  | Move away from the podium and interact with the audience. | Speak on microphone at the podium.",
      "definition": "Move away from the podium and interact with the audience."
    },
    {
      "term": "Quiz type: radio, What are Aristotle’s three proofs? | Low, middle, high | Coercion, manipulation, and persuasion | Ethos, pathos, logos",
      "definition": "Ethos, pathos, logos"
    },
    {
      "term": "Quiz type: radio, A local city council is discussing whether or not to build a new civic center. This is primarily a debate over… | Value | Fact | Policy",
      "definition": "Policy"
    },
    {
      "term": "Quiz type: radio, You and your friends having been sitting around the house all day. You have had it. You look at your friends on the couch and say, “Let’s go out to eat!” In this case, you are arguing _____ the status quo and therefore you _____ the burden of proof. | for; have | against; have |   against; don't have   | for; don't have",
      "definition": "against; have"
    },
    {
      "term": "Quiz type: radio, Let's say you're trying to raise awareness (and maybe some money) for your youth chess program. You help students develop a love for chess after school. You were able to land a speaking position at a local business mixer, and there will be some drinks, socializing, and networking. You want to persuade people to help you out. The elaboration likelihood model here provides some direction. What type of scenario is this and how will people probably process your message? | High elaboration. People will process your message centrally. | High elaboration. People will process your message peripherally. | Low elaboration. People will process your message centrally. | Low elaboration. People will process your message peripherally.",
      "definition": "Low elaboration. People will process your message peripherally."
    },
    {
      "term": "Quiz type: radio, \"What should we do?\" This is a question of: | Fact | Policy | Value",
      "definition": "Policy"
    },
    {
      "term": "Quiz type: radio, Which statement is true of the \"burden of proof\"? | It’s always the most effective stasis point to argue. | It’s the stock issue that comes immediately after “blame.” | It’s yours if you are arguing against change. | It’s yours if you are arguing for change.",
      "definition": "It’s yours if you are arguing for change."
    },
    {
      "term": "Quiz type: radio, Identify the stock issues. | Status quo, pro, con | Ill, blame, cure, consequences | Logos, pathos, ethos | Introduction, problem, solution, call to action",
      "definition": "Ill, blame, cure, consequences"
    },
    {
      "term": "Quiz type: radio, Typically we want to show both the _______________ aspects of our ill. | quantitative and qualitative | distant and present | short term and long term",
      "definition": "quantitative and qualitative"
    },
    {
      "term": "Quiz type: radio, While\nthe explicitness of the arrangement might vary based on the audience, your\naudience should probably be able to answer these questions. | Who\nis the most suitable expert to assess the ill? When should this happen? | How\nlong has the ill been around? Has the blame been publicly identified? | What\nare the ills, blames, and cures? What can we do to help with the cures?",
      "definition": "What\nare the ills, blames, and cures? What can we do to help with the cures?"
    },
    {
      "term": "Quiz type: radio, Argumentative\ncongruency means that the argumentative elements _____________. |                  all\nrun for the same amount of time | fit within the allotted time | work\nwell together",
      "definition": "work\nwell together"
    },
    {
      "term": "Quiz type: radio, Cures\nand calls to action are always different. | False | True",
      "definition": "False"
    },
    {
      "term": "Quiz type: radio, We want stories in our speeches. But we want them to be doing stuff for our argument. In this way, we typically want stories to __________________. | delight and entertain | show and prove | delight and distract ",
      "definition": "show and prove"
    },
    {
      "term": "Quiz type: radio, We want to balance stories with facts, statistics, and testimony to show that the story is_____________________. | generalizable | true",
      "definition": "generalizable"
    },
    {
      "term": "Quiz type: radio, When you want to validate your interpretation of an issue (e.g., showing that a blame is causing the ill), you should probably use some _____________. | stories | expert testimony | statistics",
      "definition": "expert testimony"
    },
    {
      "term": "Quiz type: radio, As discussed, calls to action should: | advance the cure. | always include a letter to a legislative body or policy maker. | be introduced before addressing the blame. | solve for the ill regardless of blame.",
      "definition": "advance the cure."
    },
    {
      "term": "Quiz type: radio, Select the most pressing problem (as discussed in the lectures) with the outline below.I. I. lls A. At-home daycares are popular B. At-home daycares are poorly supervised II. Blames A. Many municipalities have lax legislation regarding at-home daycares B. Many municipalities enforce existing policies ineffectively III. Cures A. We need to make sure that children are not in illegal at-home daycares B. At-home daycares should be less popular | The ills are not significant | The speech is three points | The cures don’t solve for the blames",
      "definition": "The cures don’t solve for the blames"
    },
    {
      "term": "Quiz type: radio, Identify the best and most congruent cures to complete the outline below. I. Ill A. Exploding milk cartons affect thousands of Canadians each year B. Exploding milk cartons can cause devastating injuries II. Blame A. We currently have weak legislation governing the production of milk cartons B. The public remains relatively unaware of the lurking threat of exploding milk cartons III. Cure A._________ B._________ C. If you don’t want to expire, check the expiration date | IIIA: We need to eliminate the problem at its source and get rid of dairy cows\n\nIIIB: We need to support educational organizations like Moove On and NoBoomCow to get the word out | IIIA: We must pass stricter regulation that reduces exploding milk cartons\n\nIIIB: We need to support educational organizations like Moove On and NoBoomCow to get the word out | IIIA: We need to protect Canadian citizens\n\nIIIB: We need to support hospital funding to deal with milk related injuries | IIIA: We must pass stricter regulation that reduces exploding milk cartons\n\nIIIB: We need to support hospital funding to deal with milk related injuries",
      "definition": "IIIA: We must pass stricter regulation that reduces exploding milk cartons\n\nIIIB: We need to support educational organizations like Moove On and NoBoomCow to get the word out"
    },
    {
      "term": "Quiz type: radio, Illon works at a tech company. Right now, the company is split, with many wanting to take the company public and allow for it to be publicly traded and others wanting to keep it a private company. Illon has a proposal for a new marketing campaign. Problem is, it’s been swept up in this larger debate. Those opposed to the public-option think opening the company to public trade would cause the organization to lose its character. The campaign is actually neutral on this question. Illon needs to get a vote on his new campaign in order to move forward. How might he respond to this situation? | Contain his argument. Try to show that the marketing campaign has nothing to do with the larger debate. | Attack those in favor of the private option. Try to show that marketing campaign isn’t linked to the private option by attacking that side. | Attack those in favor of the public option. Try to show that marketing campaign isn’t linked to the public option by attacking that side",
      "definition": "Contain his argument. Try to show that the marketing campaign has nothing to do with the larger debate."
    },
    {
      "term": "Quiz type: radio, Sophia is about to argue for a policy in front of her community council. She wants the council to increase city penalties for putting recyclable materials in the garbage. Right now, she argues, too many people put their recycling in the garbage. She is arguing that raising the fine from €50 to €100 will significantly improve the recycling rate, but she worries that the council won’t take her argument seriously since she is a computer programmer. What should she include to counter this concern? | Published testimony from a recycling policy expert showing the positive effects of higher fines on recycling rates. | An interview with her neighbors who agree that higher fines would help increase recycling rates. | A list of other cities and counties with fines above €50. | A story about a community that moved to better recycling through public information and fines.",
      "definition": "Published testimony from a recycling policy expert showing the positive effects of higher fines on recycling rates."
    },
    {
      "term": "Quiz type: radio, Which is the most accurate definition of a fallacy? | Fallacies are deficient moves in argumentative\ndiscourse.      | Fallacies are effective lies in communication.  | Fallacies are communication tactics that emerge from the speaker’s desire to avoid certain topics. ",
      "definition": "Fallacies are deficient moves in argumentative\ndiscourse."
    },
    {
      "term": "Quiz type: radio, In a slippery slope fallacy, the speaker: | identifies a chain of events, but doesn’t prove the\nindividual steps.      | mistakes a chronological sequence of events for a causal one.  | raises a distracting argument. ",
      "definition": "identifies a chain of events, but doesn’t prove the\nindividual steps."
    },
    {
      "term": "Quiz type: radio, \"If you believe in putting a sales tax on candy, you must hate children having any sense of joy in their lives.\" This is best described an example of: | straw\nargument. | begging\nthe question.  | slippery\nslope.  | false dilemma. ",
      "definition": "straw\nargument."
    },
    {
      "term": "Quiz type: radio, Which of the following is the best example of alliteration? | Let\nus therefore brace ourselves to our duties, and so bear ourselves that, if the\nBritish Empire and its Commonwealth last for a thousand years, men will still\nsay, This was their finest hour. (Winston Churchill) | Let us go forth to lead the land we love. (John F. Kennedy) | Never\ncould I have hoped for such great woe. (Aeneid) | Let me assert my firm belief that the only thing we have to fear is fear itself. (Franklin D. Roosevelt)",
      "definition": "Let us go forth to lead the land we love. (John F. Kennedy)"
    },
    {
      "term": "Quiz type: radio, Which of the following is the best example of asyndeton? | One question I've been repeatedly asked these past few weeks is, How do I want to be remembered? My answer has been simple: to be remembered at all is pretty special. (Cal Ripkin Jr.) | Much of what I say might sound bitter, but it's the truth. Much of what I say might sound like\nit's stirring up trouble, but it's the\ntruth. Much of what I say might\nsound like it is hate, but it's\nthe truth. (Malcolm X).  | We\nmust change that deleterious environment of the 80's, that environment which\nwas characterized by greed and hatred and selfishness and mega-mergers and debt\noverhang....  (Barbara Jordan) | Veni,\nvidi, vici (Caesar: \"I came; I saw; I conquered\")",
      "definition": "Veni,\nvidi, vici (Caesar: \"I came; I saw; I conquered\")"
    },
    {
      "term": "Quiz type: radio, We talked about antimetabole as a form of antithesis. Which of the following is the correct phrase structure for antimetabole? | ABBA |                  AAAB       | BBAA",
      "definition": "ABBA"
    },
    {
      "term": "Quiz type: radio, \"Low accountability in schools produces bad students. It stands to reason. When I look at school test scores and see poor results. I know it means one thing: that school isn't being held accountable enough.\" This is best described an example of: | Slippery Slope | Begging the question  | Red herring | Straw argument",
      "definition": "Begging the question"
    },
    {
      "term": "Quiz type: radio, Read the exchange below and then answer the question. (1) Amuro: I saw some cartoons this morning and they were so violent. That type of violence should be regulated so that children don't mimic such violent behavior. The government must censor children's television because limiting children's exposure to certain ideas and images is the government's role. (2) Kai: You are assuming that the government can do a lot by controlling what's on TV. Beyond the issue of censorship lies a problem of practicality. (3) Amuro: According to your argument, we should allow graphic violence to run during Saturday morning cartoons, showing horror films to 4 year olds. Young children shouldn't be subjected to such nightmarish images. (4) Kai: But if such restrictions on children's television become commonplace, then we will see similar restrictions popping up in adult programming, and then the government will start editing out content from the news. (5) Amuro: I'm not suggesting that, but I do think that censoring cartoons is in the public interest. Look at Canada. They put restrictions on violent Saturday morning cartoons in 1991 and by 1997 the crime rate had dropped 15%. (6) Kai: That's stupid. How can you even think that? What's wrong with you? Which one of the above passages best exemplifies a straw argument? | 1 | 2 | 3 | 4 | 5 | 6",
      "definition": "3"
    },
    {
      "term": "Quiz type: radio, Read the exchange below and then answer the question. (1) Amuro: I saw some cartoons this morning and they were so violent. That type of violence should be regulated so that children don't mimic such violent behavior. The government must censor children's television because limiting children's exposure to certain ideas and images is the government's role. (2) Kai: You are assuming that the government can do a lot by controlling what's on TV. Beyond the issue of censorship lies a problem of practicality. (3) Amuro: According to your argument, we should allow graphic violence to run during Saturday morning cartoons, showing horror films to 4 year olds. Young children shouldn't be subjected to such nightmarish images. (4) Kai: But if such restrictions on children's television become commonplace, then we will see similar restrictions popping up in adult programming, and then the government will start editing out content from the news. (5) Amuro: I'm not suggesting that, but I do think that censoring cartoons is in the public interest. Look at Canada. They put restrictions on violent Saturday morning cartoons in 1991 and by 1997 the crime rate had dropped 15%. (6) Kai: That's stupid. How can you even think that? What's wrong with you? Which one of the following passages best exemplifies a post hoc fallacy? | 1 | 2 | 3 | 4 | 5 | 6",
      "definition": "5"
    },
    {
      "term": "Quiz type: radio, In speech writing, a frame is a: | structure for interpretation and meaning making. | a subtle fallacy that we don’t want the audience to catch. | statement against the status quo. | stock issue that deals with feasibility.",
      "definition": "structure for interpretation and meaning making."
    },
    {
      "term": "Quiz type: radio, Which of the following is the best example of epistrophe? | We shall meet again before long to march together to the redemption of our brothers who are still slaves of the stranger. We shall meet again before long to march to new triumphs. (Giuseppe Garibaldi) | When a great national calamity stares us in the face, we are, I fear, too much given to depending on a short campaign of education to do on the hustings what should have been accomplished in the schoolroom. (Booker T. Washington) | With this faith we will be able to work together, to pray together, to struggle together, to go to jail together, to stand up for freedom together, knowing that we will be free one day. (Martin Luther King) | Without a healthy economy we can’t have a healthy society and without a healthy society the economy won’t stay healthy for long. (Margaret Thatcher)",
      "definition": "With this faith we will be able to work together, to pray together, to struggle together, to go to jail together, to stand up for freedom together, knowing that we will be free one day. (Martin Luther King)"
    },
    {
      "term": "Quiz type: radio, “Ums” usually indicate a _____________.  |                  lag\nin speech production     | lie\nin speech content     | gap\nin content knowledge    ",
      "definition": "lag\nin speech production"
    },
    {
      "term": "Quiz type: radio, Ums are always distracting. | False | True",
      "definition": "False"
    },
    {
      "term": "Quiz type: checkbox, Which of the techniques below were discussed for reducing ums? | Decreased speech rate | Having go-to filler phrases | Metronomes | Reading your manuscript verbatim  | Medication",
      "definition": "Decreased speech rate | Having go-to filler phrases"
    },
    {
      "term": "Quiz type: radio, Listen to the following clip (a reading from Napoleon’s 1814 “Farwell to the Old Guard”). Identify the dominant problem. | The intonation was too regular. He sounded sing-songy. | There were too many disfluencies. He said um too many times. | The pace was too rapid. He spoke too fast.",
      "definition": "The intonation was too regular. He sounded sing-songy."
    },
    {
      "term": "Quiz type: radio, Disfluencies like 'um' are a natural part of speech and can help listeners. | True | False",
      "definition": "True"
    },
    {
      "term": "Quiz type: radio, Typically, when we have an um it signals that we  | forgot what we were going to say (memory error). | need more time to figure out what we’re saying (production lag). | realized that we just said something false (truth error).",
      "definition": "need more time to figure out what we’re saying (production lag)."
    },
    {
      "term": "Quiz type: checkbox, Which of the three techniques below did we discuss for reducing disfluencies? | Decreased speaking rate | Habit reversal training | Metronomes | Shock training | Reducing speech formality | Vocal warm-ups",
      "definition": "Decreased speaking rate | Habit reversal training | Metronomes"
    },
    {
      "term": "Quiz type: radio, Let’s say you’re speaking to an audience of 35 people. How long would you want to maintain eye contact? Each eye contact event should last about... | 5 sentences. | 20 seconds. | A sentence. | 3 seconds. | A phrase-length. | A word.",
      "definition": "A phrase-length."
    },
    {
      "term": "Quiz type: radio, Which of the following is an example of a ceremonial/epideictic speech? | A keynote speaker talking about the value of leadership. | A city council debate on a new road policy.  | A scientist explaining her most recent experiment.  ",
      "definition": "A keynote speaker talking about the value of leadership."
    },
    {
      "term": "Quiz type: radio, A good ceremonial speech ________________. Select the best answer.  | makes everyone cry | makes everyone laugh | makes you the star of the show | responds well to its rhetorical situation",
      "definition": "responds well to its rhetorical situation"
    },
    {
      "term": "Quiz type: radio, This class is organized around the rhetorical canons. What are these?  | Values. Arguments. Eloquence. Presence.  | Invention. Arrangement. Style. Memory. Delivery. | Informative. Deliberative. Ceremonial.  | Content. Delivery.",
      "definition": "Invention. Arrangement. Style. Memory. Delivery."
    },
    {
      "term": "Quiz type: radio, We talked about a definition of narrative. Which is this? | A narrative is connection to our evolutionary origins. | A narrative is an emotional journey. | A narrative is an ordered sequence of events. ",
      "definition": "A narrative is an ordered sequence of events."
    },
    {
      "term": "Quiz type: radio, What is meant by “joint imagination”? | Narratives encourage audience empathy.  | People experience certain aspects of the narrative as if they were actual experiences (stuff like spatial relationships, visual appearances, voices, points of view, etc.). | Narratives encourage close inspection of an argument.  ",
      "definition": "People experience certain aspects of the narrative as if they were actual experiences (stuff like spatial relationships, visual appearances, voices, points of view, etc.)."
    },
    {
      "term": "Quiz type: radio, In a traditional plot, what’s the “inciting incident”?  | The consequences of the climax. | The event that starts the story’s action. | Background information on the characters and setting.  | The point where the conflict reaches it’s emotional peak.",
      "definition": "The event that starts the story’s action."
    },
    {
      "term": "Quiz type: checkbox, We talked about the broad functions of ceremonial speeches and epideictic rhetoric. Identify these three functions. | Speakers define values and help the audience better understand those values.  | Speakers persuade audiences to believe certain propositions.  | Speakers create community that the audiences can share.  | Speakers identify enemies to the community that the audience are asked to reject.  | Speakers display eloquence for the enjoyment of the audience. ",
      "definition": "Speakers define values and help the audience better understand those values. | Speakers create community that the audiences can share. | Speakers display eloquence for the enjoyment of the audience."
    },
    {
      "term": "Quiz type: radio, Claims tend to be _____________ in persuasive argument and _____________ in epideictic argument. | deductive; inductive | inductive; deductive | ambiguous; explicit | explicit; ambiguous",
      "definition": "deductive; inductive"
    },
    {
      "term": "Quiz type: checkbox, We can support our value claims in four main ways. Identify these ways.  | Elaboration  | Crying | Statistics | Testimony  | Stories and examples | Facts  | Arguments",
      "definition": "Statistics | Testimony | Stories and examples"
    },
    {
      "term": "Quiz type: radio, What's the organization of the traditional plot structure? | inciting incident, rising action, exposition, resolution, climax, and falling action. | exposition, inciting incident, rising action, climax, falling action and resolution. | climax, inciting incident, exposition, and resolution.",
      "definition": "exposition, inciting incident, rising action, climax, falling action and resolution."
    },
    {
      "term": "Quiz type: radio, Anecdotes are _____________ than other stories.  | funnier | shorter | more serious  | longer",
      "definition": "shorter"
    },
    {
      "term": "Quiz type: radio, We talked about the arrangement principles of simplicity, balance, and order. Balance means that each speech section is getting __________ amount of attention and length. | the same | the appropriate | a decreasing | an increasing",
      "definition": "the appropriate"
    },
    {
      "term": "Quiz type: radio, Which of the following is a topical arrangement patter? | Commemorating John Lewis \n\nOpener. Background on Congressman Lewis\n\nPoint 1. Community \n\nPoint 2. Leadership \n\nPoint 3. Forgiveness\n\nCloser. A thank you to Congressman Lewis | Commemorating Bishop Allen\n\nOpener. Welcome\n\nBackground on Allen\n\nAccomplishments and impact \n\nRecognizing his impact\n\nTie to the event\n\nCloser. Thanks to those in attendance | Commemorating my mother and Diwali\n\nOpener. Family putting up Diwali lights\n\n Diwali and the start of the story of Ram and Ravan\n\nHer mother’s background\n\nHow Ram and her mother faced challenges \n\nHow the speaker faced challenges\n\n Closer. Ram’s homecoming and the value of Diwali",
      "definition": "Commemorating John Lewis \n\nOpener. Background on Congressman Lewis\n\nPoint 1. Community \n\nPoint 2. Leadership \n\nPoint 3. Forgiveness\n\nCloser. A thank you to Congressman Lewis"
    },
    {
      "term": "Quiz type: radio, We read Tom Morello's speech inducing KISS into the Rock and Roll Hall of Fame. If you didn't get a chance to read the speech earlier, here it is again\n. Here's the basic structure of the speech. I. Opening story about Morello at his first KISS concert II. Criteria for induction to the Hall of Fame Impact Influence Awesomeness III. Members of KISS Gene Simmons Paul Stanley Ace Frehley Peter Criss IV. Closer building to an applause His arrangement might best be described as _________.  | Topical  | Narrative | Chronological",
      "definition": "Topical"
    },
    {
      "term": "Quiz type: radio, When speaking at a eulogy, your goal should be to provide a final statement about the deceased’s entire life. | False | True    ",
      "definition": "False"
    },
    {
      "term": "Quiz type: radio, When introducing a speaker, aim for comprehensiveness. Make sure to list as many of their accomplishments as possible.  | false | true",
      "definition": "false"
    },
    {
      "term": "Quiz type: radio, We talked about the three types of style in the Roman rhetorical tradition. What are these? | Conversational, business, and eloquent | Plain, middle,\nand grand | Praising, blaming, cursing",
      "definition": "Plain, middle,\nand grand"
    },
    {
      "term": "Quiz type: radio, You'll hear people talk about rhetorical questions pretty broadly. What is the best definition for rhetorical question? | A question asked for effect. | A question requiring deep thought. | A question with no answer.",
      "definition": "A question asked for effect."
    },
    {
      "term": "Quiz type: radio, Diacope involves repeating a word after a short intervening passage. Which of the following is an example of diacope? | Never could I have hoped for such great woe. (Aeneid) | I have a dream that one day this nation will rise up and live out the true meaning of its creed - we hold these truths to be self-evident: that all men are created equal.\n\nI have a dream that one day on the red hills of Georgia the sons of former slaves and the sons of former slave-owners will be able to sit down together at a table of brotherhood.\n\nI have a dream that one day even the state of Mississippi, a desert state, sweltering with the heat of injustice and oppression, will be transformed into an oasis of freedom and justice.\n\nI have a dream that my four little children will one day live in a nation where they will not be judged by the colour of their skin but by the content of their character.\n\nI have a dream today! (Martin Luther King Jr.) | Bond. James Bond. | My brother need not be idealized, or enlarged in death beyond\nwhat he was in life, to be remembered simply as a good and decent man, who saw wrong and tried to right it, saw suffering and\ntried to heal it, saw war and tried to stop it. (Ted\nKennedy)",
      "definition": "Bond. James Bond."
    },
    {
      "term": "Quiz type: radio, Let's say you have a weekly business meeting with five other divisional heads from around the company. One day, you have asked the CFO to come in and talk a bit with your working group about some pressing financial issues facing the company. The CFO is actually a friend of yours and introduce her well, but informally. You pull together some basic ideas for a 30-second introduction. What do you think will be the best way to support that short intro? | Read from a prepared\nmanuscript.  | Memorize it.",
      "definition": "Memorize it."
    },
    {
      "term": "Quiz type: checkbox, We talked about some tips for formatting your manuscript. Which three of the following are recommended? | Print on both sides of the page to save paper.  | Have around 400 English words per page. | Write out numbers and symbols.  | Staple your\nmanuscript like a book, with multiple staples going down the left side of the page.  | Don’t staple your\nmanuscript.  | Limit yourself to\n30 English words per page. | Put page turns between chunks of talk.",
      "definition": "Don’t staple your\nmanuscript. | Put page turns between chunks of talk."
    },
    {
      "term": "Quiz type: radio, We talked about seeing your script as a prop. That means you should ________________. | not use it until the performance | practice with it | never change it",
      "definition": "practice with it"
    },
    {
      "term": "Quiz type: radio, Select the best example of a tricolon. | “Never was so much owed by so many to so few.” Winston Churchill | “We must change that deleterious environment of the 80's, that environment which was characterized by greed and hatred and selfishness and mega-mergers and debt overhang....” Barbara Jordan | \"The king is dead, long live the king!\" | \"Tonight, we are a country awakened to danger and called to defend freedom. Our grief has turned to anger, and anger to resolution.\" George W. Bush. ",
      "definition": "“Never was so much owed by so many to so few.” Winston Churchill"
    },
    {
      "term": "Quiz type: radio, As we discussed, the main factor affect speech tone is ______________. | emotion | word choice | topic choice | syntax",
      "definition": "word choice"
    },
    {
      "term": "Quiz type: radio, If you are introducing someone or presenting an award, you should build to applause. You want the audience applause to ___________________. |   be as loud as possible given crowd   |   sustain the person’s trip from their seat to the podium   |   be explosive. Happening immediately after you say the name   |   fade out by the time the person reaches the podium  ",
      "definition": "   sustain the person’s trip from their seat to the podium   "
    },
    {
      "term": "Quiz type: radio, As discussed, a good opener should always do at least this one thing. |   Let people know you’ve started   |   Start with a joke or story   |   Get an applause line in early  ",
      "definition": "Let people know you’ve started"
    },
    {
      "term": "Quiz type: radio, Below is a manuscript write up. Based on our discussion, choose the version that is most written for the ear. In other words, which version is best for oral delivery in front of a live audience? | The County Shelter has been and continues to be one of the most important places for animal welfare in the region for fifty years. In that time, they have saved more animals than we can count. To date, the shelter has placed 252,500 dogs and cats in happy homes. It is for this very reason that this shelter has shaped not only our families, but also our lives.  I hope you appreciate, as I do, the invaluable contribution that this shelter has made to the region.  | The County Shelter has been one of the most important places for animal welfare in the region for fifty years. For fifty years, the shelter has saved animal lives and improved human lives. To date, the shelter has placed a quarter of a million dogs and cats in happy homes. I bet almost everyone here tonight has had a dog or cat from this shelter. They have shaped our families. Our lives.  The County Shelter isn’t just a responsible steward of the local animal population. They are the invaluable. They make our lives better and our families complete.  | The County Shelter is outstanding. They save lives. They improve families. One cannot fully appreciate the depth of resourcefulness that is demonstrated by this shelter during times of stress and strain. One only need recall the events of three years ago, when our locality was confronted with an unprecedented flood system. In that difficult time, the County Shelter was able to navigate a difficult challenge and rise above it to perform and admirable task in an honorable and noble manner. One must confront the realization that the County Shelter stands as a beacon of humanity to all creatures great and small. ",
      "definition": "The County Shelter has been one of the most important places for animal welfare in the region for fifty years. For fifty years, the shelter has saved animal lives and improved human lives. To date, the shelter has placed a quarter of a million dogs and cats in happy homes. I bet almost everyone here tonight has had a dog or cat from this shelter. They have shaped our families. Our lives.  The County Shelter isn’t just a responsible steward of the local animal population. They are the invaluable. They make our lives better and our families complete."
    },
    {
      "term": "Quiz type: radio, We talked about the role of memory in speeches. In general, you don’t need to worry about memory if you are reading a manuscript speech. | True | False",
      "definition": "False"
    },
    {
      "term": "Quiz type: radio, When our memory works best, we engage in what is called elaborative encoding. What is the best description of elaborative encoding? | We memorize content through repetition.  | We learn new ideas by changing our thought processes fundamentally.  | We forget information when we use it most often because our brains get tired.  | We link new information to existing information in our brains.",
      "definition": "We link new information to existing information in our brains."
    },
    {
      "term": "Quiz type: radio, We talked about the components of humor. The psychologist Rod Martin describes four components of humor. Identify the fourth. 1. A social context. We most often experience humor with others 2. Cognitive-perceptual process. We recognize things as humorous. 3. A behavioral expression. We laugh. 4.  | A physical reaction. Our heart rate decreases. | An identity aspect. We feel loved.  | An emotional aspect. We experience of mirth.",
      "definition": "An emotional aspect. We experience of mirth."
    },
    {
      "term": "Quiz type: radio, Many psychologists suggest that humor usually combines _________ with __________. | tragedy; time | incongruity; playfulness | anger; levity | hate; mirth",
      "definition": "incongruity; playfulness"
    },
    {
      "term": "Quiz type: radio, Below is a bit from Barack Obama’s 2009 commencement speech at Arizona State University. Where do you think is the best candidate for a humor hotspot, or a place for inserting a quick funny line? The speech is available here (around 31 minutes in): https://www.youtube.com/watch?v=Qbel5MhtDq4 ------------- One student said it best when she spoke about her senior engineering project building medical devices for people with disabilities in a village in Africa. Her professor showed a video of the folks they'd been helping, and she said, \"When we saw the people on the videos, we began to feel a connection to them. It made us want to be successful for them.\" Think about that: \"It made us want to be successful for them.\" A That's a great motto for all of us -- find somebody to be successful for. Raise their hopes. Rise to their needs. As you think about life after graduation, as you look into the mirror tonight after the partying is done. B You may look in the mirror tonight and you may see somebody who's not really sure what to do with their lives. That's what you may see, but a troubled child might look at you and see a mentor. A homebound senior citizen might see a lifeline. C The folks at your local homeless shelter might see a friend. None of them care how much money is in your bank account, or whether you're important at work, or whether you're famous around town -- they just know that you're somebody who cares, somebody who makes a difference in their lives. | A | B | C",
      "definition": "B"
    }
  ]
}
